[
  {
    "text": "",
    "page_type": null,
    "pdf_page_no": 1,
    "book_page_no": null,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/1.jpeg"
  },
  {
    "text": "Grade 4 English\n\nEnglish Adventure:\nLearn, Express and Succeed!\n\nPROJECT DIRECTOR\nSabeena Abbasi, Amena Ahmed, Nidya Mukhtar\n\nCURRICULUM LEAD/S\nSabeena Abbasi, Amena Ahmed, Rabia Tufail\n\nDESIGN LEAD\nNidya Mukhtar\n\nREVIEWER/S\nSabeena Abbasi, Amena Ahmed\n\nAUTHOR/S\nRabia Tufail\n\nDESIGN\nAasma Qureshi, Wajiha Jamil, Vaneeza Afrasiab, Zoreen Khawaja\n\nILLUSTRATION\nLine art - Huda Tufail\nColorists - Ameer Ali, Rooha Ghauri\n\nCOVER DESIGN\nSawera Jahan\n\nEDITION\n1st Edition\n\nCopyright \\\\u00a9 2023\nAll rights reserved. This book or any portion thereof may not be reproduced or\nused in any manner whatsoever without the express written permission of the\npublisher except for the use of brief quotations in a book review.\n\nPrinted in Pakistan, 2023\nISBN-13: 0-00-0-900000-0-0\n[Publisher Address]",
    "page_type": null,
    "pdf_page_no": 2,
    "book_page_no": null,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/2.jpeg"
  },
  {
    "text": "Digital Resources\n\nScan the QR code above with your camera\nOR\nUse this link\nhttp:\\/\\/textbooks.taleemabad.com\\/u1w\n\nClick here to access AI tools: https:\\/\\/chqtapt.com\\/\\nIn our digital resources you will find:\nAnswer Keys\nLesson Plans\nTranslation\nVoice-overs\nPractice\nActivities\n\nHow to use this book:\n1. Learn a concept.\n2. Colour the stars on the title page.\n\nObject: Illustration of a green bird waving, placed above the text \"Digital Resources.\"\nObject: A QR code and link provided for digital resources access, placed next to the bird illustration.\n\nIf you find this icon, open the link mentioned above to get lesson plans.\nObject: Illustration of a treasure chest with gold coins, placed at the bottom.",
    "page_type": null,
    "pdf_page_no": 3,
    "book_page_no": null,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/3.jpeg"
  },
  {
    "text": "Table of Contents\\n\\nChapter\\t\\tChapter Name\\t\\t\\t\\tPage #\\n01\\t\\tPinky's Dental Dilemma\\t\\t\\t1\\n02\\t\\tFood and Friends!\\t\\t\\t\\t13\\n03\\t\\tPinky and Jojo Write a Story\\t24\\n04\\t\\tHeroes of History\\t\\t\\t\\t35\\n05\\t\\tCulture Craze with Pinky!\\t49\\n06\\t\\tTech Tales & Starry Sights\\t64\\n07\\t\\tPinky's Safety Squad!\\t\\t77\\n08\\t\\tDream Town Builders!\\t\\t\\t88\\n09\\t\\tPinky's Personality Play\\t\\t101\\n10\\t\\tWonders of the Wild!\\t\\t\\t111\\n11\\t\\tSands, Secrets, and Schooltime Surprises\\t125\\n12\\t\\tSharing is Caring\\t\\t\\t\\t137",
    "page_type": null,
    "pdf_page_no": 4,
    "book_page_no": null,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/4.jpeg"
  },
  {
    "text": "Pinky's Dental Dilemma\n\nExplorer's Pathway\n1 Show awareness of one or more listeners by developing sensitivity to ways that others express meaning in their talk and non-verbal communication.\n2 Classify words. into different categories, and use more naming, action and describing words, from pictures, in their immediate and extended environment.\n3 Use effective strategies to tackle blending unfamiliar words to read, including sounding out, separating into syllables.\n4 Apply grade-level word analysis skills to read common high-frequency words by sight at an appropriate grade-level.\n5 Discuss the meaning of unfamiliar words encountered in the reading.\n6 Recognise the alphabetical arrangement of words based on the first three letters for a glossary or dictionary use. Use guide words, dictionary entries, and dictionary definitions to check spelling, and meaning of words.\n7 Recognise and use nouns with no change in number and also use regular and irregular nouns in writing.\n8 Recognise and apply capitalization to the initial letter of proper nouns: for initials in names of people (e.g., C. K. Lim) names of holidays, nationalities, languages, special events. Capitalize titles.\n9 Differentiate between phrase and sentence.\n10 Identify syllabic patterns in multisyllabic words.\n11 Use joined-up handwriting in all writing.\n12 Make simple sentences by using SV (subject and verb) and SVO (subject, verb, and object) pattern e.g., Alia cooks food.\n13 Recognise that sentences comprise of Subject + Predicate.\nobject: Illustration of a treasure chest with items including a pen and a speech bubble diagram.",
    "page_type": null,
    "pdf_page_no": 5,
    "book_page_no": 1,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/5.jpeg"
  },
  {
    "text": "\\nMemory Lane\\n\\nNew words to know\\nloaf\\na quantity of bread that is shaped and baked in one piece\\nraisins\\ndried, dark-coloured large grape\\nchewy\\nhaving a texture that requires a lot of chewing\\ncounter\\na flat surface in a kitchen, especially on which food can be prepared\\nspill\\nan overflow of a liquid\\nObject: Four illustrations corresponding to the words 'loaf', 'raisins', 'chewy', and 'spill', each accompanied by a visual explanatory symbol.\\n\\nActivity: Sentence Creator\\nLet's see if there's any use of these words!\\nCreate a sentence using the words above.\\n\\nJourney through the text\\n\\nPinky has a bad tooth\\n\\nEvery Sunday, Dadi makes a special loaf of bread for Pinky. This Sunday, Dadi has made two special loaves. One has nuts in it, and the other has raisins.\\n\\nPinky is very excited. She loves raisins. They are sweet and chewy. She also loves Dadi and Sundays.",
    "page_type": null,
    "pdf_page_no": 6,
    "book_page_no": 2,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/6.jpeg"
  },
  {
    "text": "Chapter 1\nPinky's Dental Dilemma\n\nHow does Pinky feel on the way to the dentist?\n\nThey see a tree with not a leaf on it. 'Look! There are no leaves on that tree. Just birds!' Dadi says. They see sheep by the road. 'They look like clouds!' Dadi jumps with joy. Pinky just nods.\n\nThey see a balloon in the shape of an octopus. Dadi claps happily. Pinky doesn't even smile. 'After the dentist's, we will go and have kulfi,' Dadi tries to cheer her up.\n\nIt is noisy at the clinic. There are a lot of men, women, and children waiting for their turn. 'Whose child is this?' the nurse shouts. She is a tall woman. A man picks up the crying boy and sits down. Soon, it is Pinky's turn. But Pinky does not open her mouth. 'If you do not open your mouth, I cannot take the bad tooth out,' the dentist says. Pinky shakes her head.\n\n'Well, why not?' asks the dentist. 'My teeth are made of milk, and they can spill out,' Pinky says, careful not to open her mouth too much, 'I cannot eat bread without my teeth.' The dentist whispers in Pinky's ear. 'You are right, but here's a secret, if you drink a lot of milk, your teeth will always be full of it.' 'Kulfi is also made of milk!' Dadi points out.\n\nPinky can't help but chuckle, forgetting her dental worries for a moment. She opens her mouth, and the dentist gently takes out her milk tooth. It's quick and painless, just like magic.\n\nHow does Pinky feel after the dentist takes out her milk tooth?\nDo you think she was still scared? Why or why not?\nObject: Three cartoon characters depicting Pinky with different emotions, a dentist, and an adult female figure, all interacting in a friendly manner.",
    "page_type": null,
    "pdf_page_no": 7,
    "book_page_no": 3,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/7.jpeg"
  },
  {
    "text": "Pinky's Dental Dilemma\n\nAs Pinky leaves the clinic, she feels a sense of relief. She knows that her milk tooth will soon be replaced by a stronger, grown-up tooth. With a big grin, she looks at Dadi and says, \"Let's go have some kulfi!\"\n\nAnd so, Pinky and Dadi enjoy a delicious kulfi together, savouring each sweet bite. Pinky's dental adventure turned out to be not so scary after all, thanks to a little secret and a lot of love from Dadi.\n\n- Diving Deeper\n\nActivity 1: Discovery Quiz\n\nLet's see if you can answer these questions!\n\n1. What does Dadi make for Pinky every Sunday?\n2. Why is Pinky scared of going to the dentist? Explain her reasons.\n3. What secret did the dentist whisper to Pinky, and how did it make her feel better about her milk tooth?\n4. Have you ever been scared of anything? Write a note about it.\n\nActivity 2: Sharing Strategies\n\nIt's better to put our heads together and think of solutions!\n\nRole-play a conversation with Pinky where you help her overcome her fear of dentists. List down three strategies to help her:",
    "page_type": null,
    "pdf_page_no": 8,
    "book_page_no": 4,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/8.jpeg"
  },
  {
    "text": "\\nActivity 3: Arrange Adventures\\nObject: Illustration of a speech bubble labeled \"Do you know your alphabets? Let's find out!\" with two cartoon characters, one portraying a dental theme.\\nArrange these words in alphabetical order:\\nloaf\\nrelief\\ndentist\\nbread\\nmouth\\nNow find these words in a dictionary. Here are some steps to follow:\\nFirst Letter: Start with each word's first letter.\\nNext Letters: Use the second and third letters to order words that start the same.\\nGuide Words: Use the top page words to help find your word's page.\\nFind the Word: Look for your word in alphabetical order on the page.\\nRead the Definition: Learn what your word means.\\n\nWrite down the definitions here:\\n1. Loaf: ____________________\\n2. Relief: ____________________\\n3. Dentist: ____________________\\n4. Mouth: ____________________\\nObject: Illustration of a cartoon figure, likely a teacher, pointing to a list of steps for dictionary use.\\n\\nActivity 1: Share and Sparkle\\nObject: Icon of smiling face with the text \"It's always nice to talk about your feelings.\" in a speech bubble.\\nExpress with Emotions\\nIt's always nice to talk about your feelings.",
    "page_type": null,
    "pdf_page_no": 9,
    "book_page_no": 5,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/9.jpeg"
  },
  {
    "text": "\\nActivity 1: Express with Emotions\n\nThink about a time when you felt a strong emotion, just like Pinky did when her face hurt.\nIt could be happiness, excitement, or even fear.\n\nDraw a picture of yourself feeling that emotion in the speech bubble. Share your drawing with a partner or a friend.\n\nExplain how you felt when you experienced that emotion. What made you feel that way?\nObject: Illustration of two characters, one having a speech bubble with a question mark and both standing on grass.\n\n\\nGrammar Playground\n\\nActivity 1: Naming Words Adventure\n\\nLet's understand nouns again!\n\nNouns are like labels for everything around us.\nThey tell us the names of people, places, things, or even animals.\nSo, whether it's your favourite pet, a famous city, or delicious fruit, naming words helps us identify and talk about them\n\nLook at the list of words below. Write \"Noun\" or \"Not a Noun\" next to each word.\n\n1. Elephant ____ Noun ____ <Example>",
    "page_type": null,
    "pdf_page_no": 10,
    "book_page_no": 6,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/10.jpeg"
  },
  {
    "text": "2. Laughing\n3. Computer\n4. Running\n5. Banana\n6. London\n\nActivity 2: Action Words Detective\nObject: Illustration of a monkey with the text \"Great! Now let's jump into verbs!\"\nVerbs tell us what someone or something is doing. Whether it's jumping, running, singing, or even thinking, verbs make sentences come alive.\n\nUnderline the verbs in the sentences below:\n1. The cat pounced on the mouse. Example\n2. Sara sings beautifully in the choir.\n3. The chef cooked a delicious meal.\n4. The rocket soared into the sky.\n5. I read my favourite book every night.\n\nActivity 3: Describe It\nObject: Illustration of a monkey with the text \"We can't forget about adjectives now can we?\"\nAdjectives are words that describe or give more information about nouns. They make our sentences richer and more interesting.",
    "page_type": null,
    "pdf_page_no": 11,
    "book_page_no": 7,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/11.jpeg"
  },
  {
    "text": "Below are some nouns. Write one or more adjectives for each noun.\n1. Dog ___________ A lazy dog\n2. Castle ___________\n3. Ice Cream ___________\n4. Book ___________\n5. Rain ___________\n6. Mountain ___________\n\nActivity 4: Regular vs. Irregular Nouns\n\nDid you know there are some nouns out there that don't follow the rules?\n\nRegular nouns usually just add 's' to become plural, like 'dog' becomes 'dogs.'\nIrregular nouns, on the other hand, change in different ways, like 'child' becomes 'children.'\nRegular Nouns:\n1. ___________\n2. ___________\nIrregular Nouns:\n1. ___________\n2. ___________\n\nActivity 5: Titles and Honours\n\nIn order to live in the real world, you need to address people properly.",
    "page_type": null,
    "pdf_page_no": 12,
    "book_page_no": 8,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/12.jpeg"
  },
  {
    "text": "Titles and honours are special words that we use to show respect or importance.\nExample: 'Mr.', 'Mrs.', or 'Dr.', are all titles.\n\nAnd when someone gets an award, like 'Best Artist,' it's an honour!\n\nUnderline the titles or honours used in these sentences below:\n\nThe principal of the school welcomed the students. Example\n\nThe President of the club gave a speech.\nShe received the Best Student award.\nDr. Wasim is a famous scientist.\nThe Queen of the United Kingdom arrived in a royal carriage.\n\nActivity 6: Phrase vs. Sentence\n\nPhrase:\nA group of words that does not express a complete thought.\nExample: \"On their way to the dentist.\"\n\nSentence:\nA group of words that expresses a complete thought and usually has a subject (who or what the sentence is about) and a verb (what the subject is doing).\nExample: \"They see a balloon in the shape of an octopus.\"\nObject: Illustration of a smiling character with speech bubble saying 'Hi there, my fantastic friends! Now, we're going to explore the difference between phrases and sentences.'",
    "page_type": null,
    "pdf_page_no": 13,
    "book_page_no": 9,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/13.jpeg"
  },
  {
    "text": "Look at the phrases and sentences. Write \"Phrase\" or \"Sentence\" next to each one.\n1. After the dentist's, we will go to have kulfi. _________ Sentence Example\n2. With a serious face. _________\n3. Pinky is afraid of the large birds. _________\n4. They see sheep by the road. _________\n5. The rocket soared into the sky. _________\n6. On their way to the dentist. _________\n\nImagination Canvas\n\nActivity 1: Syllables Split\n\nLet's start by learning about the secrets of syllables.\n\nSyllables are like puzzle pieces that make up words\nExample, In 'Pinky' there are two syllables: 'Pink' and '-y'.\n\nPick out 5 words from Pinky's story and write the number of syllables next to them:\n1. Sunday (2)\n2. _________\n3. _________\n4. _________\n5. _________\n6. _________\nobject: Illustration of a light bulb next to \"Imagination Canvas.\"",
    "page_type": null,
    "pdf_page_no": 14,
    "book_page_no": 10,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/14.jpeg"
  },
  {
    "text": "Activity 2: Craft Sentences with SVO Patterns\n\nObject: Illustration of a smiling cartoon character speaking.\n\nHey there, my creative pals, now we're going to learn about creating sentences using the SVO pattern.\n\nSubject:\nThe first slice of bread that tells us who or what.\nExample, \"Dani,\" \"Dadi,\" or \"They.\"\n\nVerb:\nThe yummy filling, showing action.\nExample, \"enjoys,\" \"see,\" or \"covers.\"\n\nObject:\nThe second slice, completing the meaning.\nExample, \"the dentist,\" \"a balloon,\" or \"special loaves.\"\n\nSVO Sentence Sandwiches:\nLet's create sentence sandwiches using the SVO pattern.\nCreate a sentence and then identify its subject, verb, and object.\nSentence: Pinky made a sandwich.\nSubject: Pinky | Verb: made | Object: sandwich\n\nSentence:\nSubject: | Verb: | Object:\n\nSentence:\nSubject: | Verb: | Object:",
    "page_type": null,
    "pdf_page_no": 15,
    "book_page_no": 11,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/15.jpeg"
  },
  {
    "text": "Chapter 1\nPinky's Dental Dilemma\n\nConnect and Create\n\nProject: Designing a Dental Health Poster\n\nImagine you're a dentist, and you want to help kids learn how to take care of their teeth and overcome their fear of the dentist.\n\nDesign and create a poster about how important it is to care for your teeth.\n\nAdd simple tips and tricks to maintain a healthy smile.\nObject: Illustration of a cartoon-style dentist working with various dental tools and a large tooth model in a bright, color-filled background.",
    "page_type": null,
    "pdf_page_no": 16,
    "book_page_no": 12,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/16.jpeg"
  },
  {
    "text": "\\nFrom Farm to Feast\n\n\\nExplorer's Pathway\nShow awareness of one or more listeners by developing sensitivity to ways that others express meaning in their talk and non-verbal communication.\nListen and understand longer conversations from different contexts, short lectures and talks, radio and TV broadcasts, stories, and descriptions of events and will be able to identify main ideas.\nRecognise and use different types of nouns i.e. common, proper, countable, uncountable nouns.\nUse effective strategies to tackle blending unfamiliar words to read,using the analogy, identifying known prefixes and suffixes using context.\nIdentify and know the meaning of the most common prefixes and suffixes (Pre-, re-, mis-, -less, -ful).\nUse pre-reading strategies to predict the type of content/vocabulary/questions about the text from pictures title etc., by using prior knowledge (identify the type of text, purpose and intended audience).\nRecognise and use grade-level words that show feelings and emotions (e.g. terrified, disgruntled, and embarrassed).\nLearn to join prefixes and suffixes with the base words and understand the change of meaning (e.g., act-active, build-builder).\nRecognise and use the common grammatical gender nouns.\nPractise fast, fluent and legible handwriting styles for different purposes and use punctuation marks appropriately.\nSpell high frequency and irregular words.\nComplete a simple paragraph using the given words, phrases and sentences.",
    "page_type": null,
    "pdf_page_no": 17,
    "book_page_no": 13,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/17.jpeg"
  },
  {
    "text": "Memory Lane\n\nNew words to know\npaddy\na field where rice is grown\nsprout\nto begin to grow; when a new plant starts to emerge from a seed\nchuckle\nlaugh quietly or to oneself\nharvest\nthe process of gathering mature crops from the fields\n\nActivity: Word Play\n\nTime to put these words into use.\n\nPlay a game where you take turns making up sentences using these words. If you make someone laugh, you win extra points!\n\nJourney through the text\n\nA Biryani Plate\n\nOnce upon a time in Taleemabad, Pinky and her brother Jojo decided to uncover the story of how their favourite dish, Biryani, made its way from the farm to their dining table.\n\"Let's be detectives today and discover the journey of our meal,\" said Pinky, her eyes sparkling with excitement.\nJojo, a little hesitant but curious, nodded, \"Okay, but where do we start?\"\n\"At the beginning, of course! Every dish has a story, and Biryani's story starts here.\"",
    "page_type": null,
    "pdf_page_no": 18,
    "book_page_no": 14,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/18.jpeg"
  },
  {
    "text": "But just as Pinky is about to take her first bite, she feels a sharp pain. 'Oh Dadi! My face hurts!' Pinky says, holding a hand to her right cheek. 'It must be your milk tooth. I think we have to take it out,' Dadi says. 'My teeth have milk in them?' Pinky thought.\n\nPinky does not like going to the dentist.\n\nHow do you read the word 'raisins'? Pick out the silent letter in it There are many reasons why she doesn't like going to the dentist. She still remembers her last visit. The dentist's tools were sharp and scary.\n\nA nurse at the counter shouted, 'One person at a time, please. Some people looked very sick! 'Can I have kulfi later? Please!' Pinky asks Dadi. 'Only if you promise to brush your teeth!' Dadi replies.\n\nDadi covers the special loaves with a cloth. 'We don't want mice to find it,' she says. 'No mouse in my house!' Pinky says with a serious face.\n\n'That's right! Now which shelf shall I keep this on?' Dadi looks around the kitchen. She places the bread on the shelves by the door. They leave for the dentist.\n\nOn their way, they see many wonderful things. Dadi enjoys it a lot, but Pinky sits quietly.\n\nobject: Illustration of Pinky holding her cheek in pain while standing near Dadi, who is comforting her.\nobject: Illustration of a nurse and Dadi with Pinky at a counter, and a dish with what appears to be bread covered by a cloth.",
    "page_type": null,
    "pdf_page_no": 19,
    "book_page_no": 15,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/19.jpeg"
  },
  {
    "text": "Chapter 2\nFrom Farm to Feast\nstarts with rice,\n\"First, we need to understand how the rice is grown,\" Pinky explained, pulling out a map. \"It all starts at the farm!\"\nObject: Shaped text box with rounded corners and drop shadow containing the question \"What does rice need to grow well? Can you guess from what you've seen around?\"\nThey arrived at a lush green field where farmers were busy tending to the rice paddies. The farmer, Uncle Aamir, waved at them. \"Ah, Pinky and Jojo, you want to learn about rice? It grows in these wet fields called paddies.\"\nObject: Shaped text box with rounded corners and drop shadow containing the question \"What is a 'paddy'? Look at the picture, isn't it different from other fields?\"\nUncle Aamir showed them the rice plants, explaining how the seeds needed water and sunshine to sprout. \"After months of care, they become ripe and ready to harvest,\" he said. Pinky was fascinated. \"And then it comes to our plates as Biryani?\" she asked excitedly. \"Not so fast,\" Uncle Aamir chuckled. \"After harvest, the rice must be cleaned and cooked. Each step is important to make it just right for your Biryani.\" They watched as the harvested rice was gathered and taken to a mill to be cleaned.\nObject: Illustration showing a scene of three people (Uncle Aamir and two children, Pinky and Jojo) around a pot of Biryani, with food items like a plant, and cooking pot visible.\nObject: Shaped text box with rounded corners and drop shadow containing the question \"Can you name some spices that go into Biryani? Look at the colours and shapes!\"",
    "page_type": null,
    "pdf_page_no": 20,
    "book_page_no": 16,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/20.jpeg"
  },
  {
    "text": "Next, they visited the local market where spices scented the air. \"Spices are the heart of Biryani,\" the spice seller told them, handing Pinky a small bag of fragrant cumin. \"Without these, your dish would not have flavours.\"\n\nWith a bag full of spices and rice, they headed home. Pinky and Jojo watched as their mother transformed these ingredients into the delicious Biryani they loved so much.\n\nAs they sat down to enjoy their meal, Pinky said, \"We've seen it all, from seed to our plate. Our Biryani doesn't just taste good, it tells a story of hard work and tradition.\"\n\nJojo nodded, \"And it's a story of our culture, right here in our bowl!\"\n\n\nDiving deeper\n\nActivity 1: Dig inside the Dish\nObject: Illustration of a character thinking, with a speech bubble with text \"Now, it's time to put on our thinking caps!\"\nAnswer the following questions:\n1. Where does the journey of biryani rice begin according to Uncle Aamir?\n2. Find the part in the story where Uncle Aamir talks about where rice comes from.\n3. Why is it important to clean the rice after harvest?",
    "page_type": null,
    "pdf_page_no": 21,
    "book_page_no": 17,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/21.jpeg"
  },
  {
    "text": "Share and Sparkle\n\nActivity 1: Potluck Party\nObject: Illustration of three children, one holding a spoon, another with a fork, engaging in a pretend feast around a bowl.\nLet's host a pretend feast in our classroom.\n\nEach student will prepare a short talk about their favourite meal or a food-related story from their life. It could be about a time you helped in the kitchen or a meal at a special event.\n\nListen to other stories carefully and attentively.\n\nGrammar Playground\n\nActivity 1: Word Builder\nDid you know that some words have little parts that can be added to change their meanings?\n\nA prefix goes at the start, like 're' in 'replay', which means to play again.\nA suffix goes at the end, like 'less' in 'fearless', which means without fear.\nAdd 'pre-' to 'cook' and what do you get?\nNew Word: Precook.\nMeaning: to cook beforehand\nCan you add 'mis-' to 'understand' and write what it means?\nWhat happens if you add '-ful' to 'joy'?",
    "page_type": null,
    "pdf_page_no": 22,
    "book_page_no": 18,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/22.jpeg"
  },
  {
    "text": "Activity 2: Noun Town\n\nIn Noun Town, we have a wide variety of nouns.\nObject: Illustration of a smiling female character with pink hair.\nCommon nouns are general names like 'city' or 'girl'.\nProper nouns are specific names like 'Karachi' or 'Fatima'.\nCountable nouns are things we can count like 'apples' or 'books'.\nUncountable nouns are things we can't count like 'water' or 'sugar'.\n\nLook around your classroom and find two common nouns, then two proper nouns.\n\nCommon nouns\n________________________\n________________________\n\nProper nouns\n________________________\n________________________\n\nList three countable nouns you'd see at a feast.\n________________________\n________________________\n________________________\n\nList three uncountable nouns you'd see at a grocery store.\n________________________\n________________________\n________________________",
    "page_type": null,
    "pdf_page_no": 23,
    "book_page_no": 19,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/23.jpeg"
  },
  {
    "text": "\\nActivity 3: Gender Bender\\nAre you ready to learn about gender nouns?\\nSome nouns tell us if the person is a girl or a boy, like 'actor' or 'actress'. But, some nouns are used for both and don't change, like 'teacher' or 'doctor'.\\nNow, look at these words and write its gender noun:\\n1. Actor _______ Actress \\\\u2190 Example\\n2. Waiter _________________\\n3. Cook _________________\\n4. Author _________________\\n5. Lioness _________________\\n6. Princess _________________\\nObject: Illustration of a girl holding a flag that reads 'less' with a 'mi' prefix marked on the ground next to ice cream cones.\\n\\nImagination Canvas\\nActivity 1: Biryani Recipe Writing\\nI'm planning to surprise my mother with a fresh plate of Biryani. Help me out!\\nWrite down the recipe for a simple Biryani. Include ingredients like rice and spices, and don't forget the commas and full stops!\\nObject: Illustration of a steaming plate of Biryani.",
    "page_type": null,
    "pdf_page_no": 24,
    "book_page_no": 20,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/24.jpeg"
  },
  {
    "text": "Step 1\nWash the rice.\nStep 2\nHeat the cooking pot\nStep 3\nAdd oil and spices.\n\nObject: Heading labeled \"Activity: Biryani Recipe Writing\" with a lined writing area beneath it.\n\nActivity 2: Spice Up Your Sentences\n\nPunctuation marks are like spices, adding flavour to our sentences.\n\nAdd punctuation marks (., !, ?) to these sentence to make them perfect.\n1. In the Biryani pot rice, the spices, and water bubble together happily\n2. We are going to need cumin turmeric salt and pepper for the Biryani",
    "page_type": null,
    "pdf_page_no": 25,
    "book_page_no": 21,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/25.jpeg"
  },
  {
    "text": "3. Let's dig into this yummy feast\n4. Can you pass me the plate Amna\n5. Write a sentence about your favourite food and show how you use different punctuation marks.\n\nExample: \"My favourite dish is biryani: it's spicy, fragrant, and always makes me happy!\"\n\nConnect and Create\n\nHello, my creative friends! Remember how we followed the journey of Biryani from the paddy fields to our plates?\n\nNow, it's your turn to be the author and create a storybook about your food journey.\n\nRemember, your storybook doesn't have to be perfect - it's about the story you tell and the journey you share. Have fun, and let's make our food journey as interesting as the foods themselves!\n\nProject: My food journey\nStorybook Setup: Think of a local food you love and trace its journey, just like we did with biryani. It could be the path of a mango from a tree to a yummy aam ka achaar (mango pickle) or a wheat stalk becoming a warm roti.\nObject: Illustration of a woman at a picnic table with a child, enjoying a meal together. The woman appears happy, and the child is showing excitement. There's a speech bubble saying, \"My favourite dish is biryani: it's spicy, fragrant, and always makes me happy!\"",
    "page_type": null,
    "pdf_page_no": 26,
    "book_page_no": 22,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/26.jpeg"
  },
  {
    "text": "Chapter 2\nFrom Farm to Feast\n\nParagraph Puzzler: Look back at our 'Journey Through the Text' and find the hidden word spelled out by the first letter of each paragraph. What word is it?\n\nObject: Illustration of a cartoon character holding a magnifying glass, appearing to search within a large outline box.\n\nWord Weaver: Using the hidden word as inspiration, start your story. I'll give you a few words to help: farm, market, kitchen, cook, and feast. Use these words to complete a simple paragraph about your chosen food's journey.\n\nObject: Illustration of a cartoon character with a chef hat speaking through a speech bubble, indicating depth by pointing downward into a large outline box.",
    "page_type": null,
    "pdf_page_no": 27,
    "book_page_no": 23,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/27.jpeg"
  },
  {
    "text": "3\nTeamwork Champions\n\nExplorer's Pathway\n\nDeduce meaning from context in short, supported talk on an increasing range of general and curricular topics.\nAsk questions to obtain information and explain ideas clearly, making meaning explicit.\nExpress understanding of the text in your own words.\nUse of indefinite (a\\/an) and definite (the) articles. Zero article: no article for uncountable nouns (e.g., I like music and I can play the guitar).\nRead grade-appropriate irregularly spelled words. Recognise and match contractions to words (e.g., couldn't \\u2013 could not). Recognise silent letters in words and match sounds to their corresponding letter patterns.\nRead and evaluate a variety of texts for purpose, style, clarity and organisation.\nUse descriptive imagery based on sight, touch & sound. Also, use words to suggest characterisation.\nRead and enjoy a variety of reading-age- appropriate non-print sources (books and texts from print and and high-interest: i.e. poetry: synonyms poems, rhymes, with tongue twisters, alliterations)\nRecognise and generate rhyming strings in writing (e.g., jokes, riddles, poems).\nTake dictation of paragraph\\/ text of grade level. Keep a record of words (e.g., word wall, word bank, word journal).\nIdentify and use a reciprocal pronoun (i.e. each other, one another).\nClassify adjectives of quantity, quality, size, shape, colour and origin.\nUnderstand and use adjectives in sentences before nouns and after verbs. (e.g., The food is delicious.\\/The delicious food is served).\nRecall and practice that sentences structure with SVO pattern and identify predicates.\nMake simple sentences by using SV (subject and verb) and SVO (subject, verb, and object) pattern e.g., Ajai cooks food.\nDemonstrate an understanding of the use of spelling patterns, e.g., vowel phonemes, double consonants, silent letters, common prefixes and suffixes, etc.\n\nObject: Diagrams and illustrations surrounding text blocks, numbered from 1 to 16 with corresponding descriptions of educational content areas.",
    "page_type": null,
    "pdf_page_no": 28,
    "book_page_no": 24,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/28.jpeg"
  },
  {
    "text": "Memory Lane\n\nNew words to know\nstout\nwhen something is strong and thick\nrally\nwhen people come together to support something\ndeclared\nwhen someone in charge says something must happen, like a rule\nforetold\nWhen a story or a person tells us about something that will happen in the future\ntoil\nto work very hard for a long time\nslash\nto move around in water or liquid, making sounds\nquash\nto stop something\n\nActivity 1: Word Wizardry\nHold on! Before you head towards the story, let's add to our vocabulary.\n\nHere's a big word wall. Decorate each brick with a picture that shows what the word means.\nObject: Image of a child with arms spread standing next to a big 'word wall' with empty pink bricks.",
    "page_type": null,
    "pdf_page_no": 29,
    "book_page_no": 25,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/29.jpeg"
  },
  {
    "text": "Journey through the text\n\nTeamwork Champions\n\nIn Taleemabad, where the river runs wide,\nA whisper of the flood was spreading inside.\nPinky and Jojo, with hearts brave and stout,\nRallied the town as the waters broke out.\nObject: Illustration of an activity box with text saying \"Find a word that has a silent letter.\"\n\nPeople gathered, some tense, some amused,\nBut together, their strength couldn't be refused.\n\"Let's build a barrier,\" Pinky screamed,\n\"Teamwork's our anchor in times of great need!\"\nObject: Illustration of an activity box with text saying \"Underline the contraction used in this stanza.\"\n\nJojo took charge of the young and the old,\nGuiding them safe to the shelters foretold.\nPinky, with neighbours, sandbags did stack,\nEach one placed a firm, with no courage they lacked.\n\nThe flood came and went, like a dream in the night,\nBut Taleemabad stood, thanks to their plight.\nThe lesson was clear, through the tail and the slosh,\nWhen we unite, any disaster we'll quash.\nObject: Illustration of Pinky and Jojo stacking sandbags on a flood barrier with the text asking to \"Find a word that rhymes with 'night' in the poem.\"",
    "page_type": null,
    "pdf_page_no": 30,
    "book_page_no": 26,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/30.jpeg"
  },
  {
    "text": "\\nDiving deeper\\n\\nActivity 1: Flood of Questions\\n\\nObject: Icon of an open book with text overlay \"Time to look closely at our poem for some answers.\"\\nAnswer these questions.\\n1. Who in the poem took the lead to start building the barriers?\\n2. What role did Jojo play during the flood?\\n3. What word describes the movement of water during the flood?\\n\\nActivity 2: Evaluate the Poem\\n\\nObject: Icon of a smiling face with text \"I love poems. They are made of so many different parts!\"\\nEvaluate the poem you just read according to its purpose, style, clarity and organisation.\\n1. Why was this poem written? Write down the purpose.\\n________________________________________________\\n2. Circle the type of tone used in this poem:\\na. Hopeful\\nb. Sad\\nc. Angry",
    "page_type": null,
    "pdf_page_no": 31,
    "book_page_no": 27,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/31.jpeg"
  },
  {
    "text": "3. Mark \\u25EF or \\u274C for the following statements about the poem:\n\na. I understood what the poem was about.\n\nb. I liked how the poem was divided into stanzas.\n\nc. The poem had a beginning, middle and an end.\n\nShare and Sparkle\n\nActivity 1: Weave a Poem Together \\uD83D\\uDC9C\n\nTogether we can create magic\\n\nCreate Your Poem.\n\nIn groups, use the following sentence starters to build your poem.\nEach member adds a line, and together, you make a four-stanza poem.\n\nStanza Starters\n\n1. When the sky grows dark and the rain pours down\n\n____________________________________\n\n____________________________________\n\n____________________________________\n\n2. Together we stand, hand in hand,\n\n____________________________________\n\n____________________________________\n\n____________________________________",
    "page_type": null,
    "pdf_page_no": 32,
    "book_page_no": 28,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/32.jpeg"
  },
  {
    "text": "3. Like the river's flow, our teamwork grows\n_____\n_____\n_____\n4. With every sandbag stacked, we showed that\n_____\n_____\n_____\nPresent and Share\nOnce your group has created a poem, present it to the class. Explain your idea to everyone.\nObject: Illustration of three children and an adult looking at a note, with the adult pointing towards it.\n\nGrammar Playground\n\nActivity 1: Rhyme Time\nObject: Icon indicating a rhyming activity, with a speech balloon containing the text \"Rhyming strings make our words sing!\"\nWhen words rhyme, they have the same ending sound, like 'hat', 'cat', and 'bat'.\nExercise Questions:",
    "page_type": null,
    "pdf_page_no": 33,
    "book_page_no": 29,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/33.jpeg"
  },
  {
    "text": "Chapter 3\nTeamwork Champions\n1. Circle the word that rhymes with 'light': 'kite', 'bite', 'sit'.\n2. Think of two words that rhyme with 'dream'.\n3. Write a sentence that rhymes with 'mouse'.\n4. Create a riddle that ends with a word rhyming with 'blue'.\n5. Find the rhyming pair: 'frog', 'log', 'dog', 'cat'.\n\n- Activity 2: Dictation Station\nObject: Icon of a pencil with a caption \"Let's put our words to use\"\nYour teacher will read out a short paragraph, and you'll write down what you hear.\n\n- Activity 3: Word Bank Bonanza\nObject: Icon of a treasure chest with a caption \"Let's collect words like treasure\"\nA word bank helps us remember and use new words.\n1. Add five new words you learned this week to your word bank.\n2. Use one word from your word bank in a sentence.\n3. Share your favourite word from your word bank with the class and explain why you like it.\n\n- Activity 4: Pronoun Parade\nObject: Icon of a parade with a caption \"We're back with some pronouns!\"",
    "page_type": null,
    "pdf_page_no": 34,
    "book_page_no": 30,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/34.jpeg"
  },
  {
    "text": "'Each other' and 'one another' are reciprocal pronouns. They show sharing or giving between two or more people.\\nObject: Example label with a purple border.\\nThe friends smiled at each other and promised to stay in touch.\\n\\nFill in the blank:\\nThe kittens chased _______ all day long.\\nWrite a sentence using 'each other' about two friends.\\n________________________________________________________________\\n________________________________________________________________\\n\\nChoose the correct reciprocal pronoun:\\n\"The dancers bowed to (each other/one another) after the performance.\"\\n\\nActivity 5: Predicate Party\\nThere's a special addition in the SVO pattern.\\nObject: Emoji of a smiling face with earrings.\\nThe predicate is the part of a sentence that tells us what the subject does or is. It includes the verb and any object or complement that comes after it. It's everything in the sentence except the subject.\\n\\nObject: Example label with a wavy underline.\\nThe cat sat on the mat.\\nSubject: \"The cat\" (who or what the sentence is about)\\nPredicate: \"sat on the mat\" (tells us what the subject is doing)",
    "page_type": null,
    "pdf_page_no": 35,
    "book_page_no": 31,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/35.jpeg"
  },
  {
    "text": "Underline the predicate in the sentence below.\nThe magician performed a trick.\nThe birds fly south for the winter.\nThe teacher assigned homework on Friday.\n\nObject: Illustration of a magician and various educational stands with labels such as 'Dictation Station', 'Rhyme Time', 'Bonanza Puzzle', and 'Predicate Party'.\n\nImagination Canvas\n\nActivity 1: Word Search Puzzle\n\nFind the hidden words with spelling patterns in the puzzle below:\nObject: A word search grid with letters arranged in rows and columns.",
    "page_type": null,
    "pdf_page_no": 36,
    "book_page_no": 32,
    "page_figures": [
      "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_page_figures/1146/17727/36/74119a80-35e7-41a2-9213-51067300f06d.jpeg"
    ],
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/36.jpeg"
  },
  {
    "text": "\\nActivity 2: Matching Game\nObject: Illustration of a character stating 'Time to learn some spelling!'\nMatch the word to its correct spelling pattern on the right:\n\nVocabulary\tSpelling patterns\nDelicious\t-able\nBicycle\t-ous\nHopeful\t-ible\nSwimming\tDouble consonant\nTelephone\tSilent letter\n\n\\nActivity 3: Building Words\nObject: Illustration of a character stating 'Suffixes and prefixes'\nUse prefixes and suffixes to create new words related to disaster management. For example, add \"un-\" to \"safe\" to create \"unsafe\".\n\nCreate three new words using prefixes or suffixes, and explain their meanings.\n\n\n\n\\nActivity 4: Sentence Creation\nObject: Illustration of a character stating 'Let's make 3 sentences using SV (Subject and Verb) and SVO (Subject, Verb, and Object) patterns.'\nLet's make 3 sentences using SV (Subject and Verb) and SVO (Subject, Verb, and Object) patterns.",
    "page_type": null,
    "pdf_page_no": 37,
    "book_page_no": 33,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/37.jpeg"
  },
  {
    "text": "Chapter 3\nTeamwork Champions\n\nExample: Community (Subject) rallied\n(Verb) together (Object).\n\nObject: Illustration of a diagram showing the syntax structure 'Community (Subject) rallied (Verb) together (Object).'\n\nConnect and Create\n\nObject: Icon of a light bulb beside the section title 'Connect and Create.'\nHello, young poets! Today, we're going on a narrative poetry adventure.\nBut first, let's understand what a narrative poem is. It's like telling a\nstory through poetry, where you share events, actions, and emotions.\n\n\"Remember the poem we read in 'Journey Through the Text'? It\nnarrated a community's teamwork during a flood. Now, it's your turn\nto write a narrative poem.\"\n\nYour Adventure Prompt:\nIt could be a local event or a fictional story.\nNow, write a narrative poem about that event.\nRemember to describe the problem, the roles people played, and\nhow they worked together.\"\n\nObject: Icon of a thinking face next to the prompt section.\nThink about a problem you've faced or heard about where\npeople worked together to solve it.\n\nHere's an example:\nTitle: \"The Flood's Challenge\"\n\nOnce upon a time in Taleemabad town,\nA mighty flood was coming, swirling all around.\nPinky, Jojo, and friends, without a frown,\nWorked as a team to keep the town safe and sound.\n\nNow, it's your turn to weave your tale in poetic form. Use your\ncreativity and the theme of teamwork. Don't forget to share your\nadventure!",
    "page_type": null,
    "pdf_page_no": 38,
    "book_page_no": 34,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/38.jpeg"
  },
  {
    "text": "4\nThe Great Debate\n\nExplorer's Pathway\n\nDemonstrate attentive listening and engage appropriately with empathy and respect, taking into account opinions and ideas shared by others while developing their own.\n\nTalk confidently in extended turns and listen purposefully in a range of contexts.\n\nUse of quantifiers with countable and uncountable nouns (some, few/little, many, much, no, both/all, each/every)\n\nRecognise silent letters in words and match sounds to their corresponding letter patterns.\n\nRecognise and read: Word families with vowel-consonant patterns. Final \"y\" as a vowel consonant digraphs in initial position (e.g., th, sh, ch, wh). Vowel digraphs initial consonant blends (e.g., sw, sn, sk, bl, br, cl, cr, dr, fl, gl, pl, pr, sl, sm, sp, st, tr, tw, qu, au).\n\nRead a range of fiction and non-fiction books and begin to make links between them.\n\nDifferentiate between personal likes and dislikes and writer's technique of making reader develop a perspective.\n\nRead and enjoy a variety of reading-age-appropriate and high-interest books and texts from print and non-print sources: Personal recounts (e.g., diary entries)\n\nRead, pronounce, write, and understand the meaning of common abbreviations for titles, and time periods (e.g., Ms., Mrs., months, days of the week, a.m.,p.m.)\n\nLocate, provide, and use words similar (synonyms e.g., walk, march, strut, prance) and opposite (antonyms e.g., ancient/modern, current, fresh, new) in different contexts to make their meanings clear.\n\nIntroduce first, second, and third-person pronouns.\n\nRecognise and use full stop with some abbreviations, and hyphen with common compound words.\n\nApply strategies to learn and check correct spellings with words that need to be learned.\n\nUse and compare/replace words to make writing meaningful.\n\nConclude the writing piece by giving a remark about all the aspects in a few sentences.\n\nParaphrase the text in your own words.\nObject: Diagram resembling a branching pathway leading to various nodes with textual information.",
    "page_type": null,
    "pdf_page_no": 39,
    "book_page_no": 35,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/39.jpeg"
  },
  {
    "text": "Memory Lane\n\nNew words to know\nanticipation\nwaiting for something exciting to happen\nanimation\nmoving pictures created on a computer or by drawing\npros and cons\nthe advantages and disadvantages of something\ne-books\nbooks that are available in digital form to read on electronic devices\neye strain\ndiscomfort in the eyes after looking at something for a long time\nObject: Illustrations of a computer monitor with an animation, plus and minus signs, an e-reader or tablet, and an eye with discomfort lines.\n\nSpell Check\nMatch the word to its correct spelling.\n\nExample,\nStrain or Eye Strain?\n'Animation' or 'Animation'?\nAntisipation or Anticipation?\nProse and Cons or Pros and Cons?\nE-buks or E-books?\nObject: Illustration of a teacher pointing at words on a large book, beside images representing the words 'animation', 'anticipation', 'pros and cons', and 'eye strain'.",
    "page_type": null,
    "pdf_page_no": 40,
    "book_page_no": 36,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/40.jpeg"
  },
  {
    "text": "\\n\\nJourney through the text\\n\\nThe Great Debate\\n\\nIn the heart of Taleemabad, the sun rose over a morning filled with digital excitement. The schoolyard buzzed with anticipation about the new smart tablets. Pinky, always curious and adventurous, was brimming with ideas, while Jojo, her brother, was scratching his head, unconvinced.\\n\\n\"Why fix what isn't broken?\" Jojo muttered, looking at his worn-out Maths workbook fondly.\\n\\nPinky laughed, her eyes sparkling, \"Jojo, it's not about fixing. It's about making it even better! Imagine learning Maths with animations!\"\\n\\nBefore they could delve deeper, Sir Riaz, with his gentle smile and wise eyes, called for attention. \"Let's gather around, young minds. Today we'll embark on a discussion journey, weighing the pros and cons of technology in our classroom.\"\\n\\nAs the students formed a circle, Sir Riaz pointed to the tablets gleaming under the morning sun. \"Pinky, please share your thoughts with us first.\"\\n\\nStanding up, Pinky was a picture of enthusiasm. \"Friends, these tablets are doorways to a world of knowledge. They make learning alive! With these, we can see the pyramids of Egypt or the depths of the ocean without leaving our seats!\"\\n\\nObject: Illustration of a speech bubble with text \"What positive aspects of technology is Pinky highlighting? Do you feel the same excitement?\"\\n\\nNot everyone was swayed. Asim, with his thoughtful frown, spoke next. \"I agree that they are fascinating, but my brother says that too much screen time can cause headaches. What about that?\"",
    "page_type": null,
    "pdf_page_no": 41,
    "book_page_no": 37,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/41.jpeg"
  },
  {
    "text": "Chapter 4\nThe Great Debate\n\nObject: Icon of a speech bubble containing the question \"Can you understand Asim's concerns? How do you think we can balance screen time and health?\"\n\nJojo, usually shy, felt a tug of responsibility to speak up. \"I like my books. I like to touch the pages, and I worry that I might miss that with a tablet.\"\n\nObject: Icon of a speech bubble containing the question \"Do you understand why Jojo likes real books? What do you like about real books?\"\n\nPinky, ever the optimist, quickly jumped in. \"But imagine, Jojo, carrying a whole library with you anywhere! And with e-books, we save so many trees!\"\n\nThe debate was in full swing now. Students shared their thoughts, their worries, and their dreams. Sir Riaz listened and then gently guided, \"Think about how these tools can help us learn more, not take over. They should make learning better, not change the good things we already do.\"\n\nThe children nodded, understanding the small difference. They discussed rules for tablet usage, like special screen protectors to prevent eye strain and scheduled breaks to ensure no one spent too long on the device.\n\nObject: Icon of a speech bubble containing the question \"What solutions can we think of to make technology a healthy part of learning?\"\n\nThe story of Taleemabad was becoming an example of progress, with every child adding a little bit to the story of learning with technology. They debated, they disagreed, but most importantly, they learned to listen and consider viewpoints different from their own.\n\nAs the day ended, Sir Riaz concluded, \"Today, you've all shown the wisdom of Taleemabad. You've debated with respect and thought deeply about how technology can be our friend in learning.\"\n\nThe children of Taleemabad left the schoolyard with a new badge of honor.",
    "page_type": null,
    "pdf_page_no": 42,
    "book_page_no": 38,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/42.jpeg"
  },
  {
    "text": "honour - not just the one earned from the debate but also the knowledge that their opinions mattered, that they could shape their educational journey.\n\nReflect on today's discussion. How has it changed your opinion about technology in education?\n\nDiving Deeper\n\n1. What did Pinky say could make learning Maths even better?\n2. Jojo loves his books for a special reason. Can you remember why?\n3. Asim mentioned a downside of using tablets. What was his concern?\n4. How did Sir Riaz suggest they use the tablets in learning?\n5. Write down three to four keywords that come to mind when you think about technology and learning.\n\nActivity 2: Anagram Architects\n\nObject: Illustration of three animated characters with question marks above their heads, labeled \"What's an Anagram?\"\n\nAn anagram is a word or phrase formed by rearranging the letters of a different word or phrase, using all original letters exactly once. Like how Heart can be turned into Earth.\n\nNow make anagrams of the words below:\n\nBare\nAnagram: ____________\nHint: An animal you might find in the forest.",
    "page_type": null,
    "pdf_page_no": 43,
    "book_page_no": 39,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/43.jpeg"
  },
  {
    "text": "Silent\nAnagram: ____________\nHint: What you do with your ears to hear sounds.\n\nDusty\nAnagram: ____________\nHint: What you do with books to learn.\n\nListen\nAnagram: ____________\nHint: Quiet, without any noise.\n\nActivity 1: Rech Talk Roundtable\nHey friends! Let's get together and have a Chatterbox Challenge! We're going to talk about technology in our lives and listen to what our friends have to say. Remember, everyone's opinion is like a precious gem that makes our Taleemobad treasure box even richer!\n\nGather in a circle with your classmates, just like we did in our story. Each one of you will get a chance to be the speaker, and the others will be the listeners. When it's your turn, talk about one of the ways technology helps you learn something new. It could be a game on a tablet, a cool video you saw, or even how you learned a new English word online!\n\nListeners, your job is to listen closely and then say one nice thing about what the speaker shared. Maybe you learned something new, or you liked how they spoke. Let's fill our roundtable with kind words and bright ideas!\nObject: Illustration of a smiling cartoon character with the caption \"Share and Sparkle\".",
    "page_type": null,
    "pdf_page_no": 44,
    "book_page_no": 40,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/44.jpeg"
  },
  {
    "text": "\\nActivity 1: Rech Talk Roundtable\\nHere are some sentence starters to help you:\\n\\\"I like how you mentioned...\\\" \\\"I learned from you that...\\\"\\n\\\"It's interesting that you think...\\\"\\nObject: Illustration of a group of children seated around a round table, participating in an activity titled 'Chatbox Challenge,' with various speech bubbles and symbols like a lightbulb, heart, and music notes.\n\\nGrammar Playground\\nHello, bright minds! Let's play with words and discover how to use them in fun ways.\\n\\nActivity 1: Quantifier Quest \\nQuantifiers are words that tell us how much or how many of something we have.\\nFor countable things like apples, we can use words like some, few, many, and each. For uncountable things like water, we use words like little, much, and no.",
    "page_type": null,
    "pdf_page_no": 45,
    "book_page_no": 41,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/45.jpeg"
  },
  {
    "text": "Chapter 4\nThe Great Debate\n\nExample: \"I have many friends at school, but only a little time to play with each of them.\"\n\nChoose any word from the list below to complete the sentences given below.\nsome  a few  many  much  no  both  all  each  every\n\n1. I have _____ pencils in my case, but _______ ink in my pen.\n2. There are _____ boys and _____ girls in the class; _____ are ready to learn!\n3. Pinky ate _____ candy and now she has _______ left.\n4. In Taleemabad, _____ child has ______ chance to be great.\n5. We saw _____ birds in the sky but ______ fish in the pond because it was empty.\n6. Jojo has _____ new video games, but he plays _______ of them _______ day.\n\nActivity 2: Silent Letter Hunt\n\nObject: Illustration of a smiling female character with the note \"Did you know silent letters are like secret agents in words? They are there, but you can't hear them! For example, in the word 'knight,' the 'k' is silent.\"\n\nExample: \"The knight in the story was brave.\"\n\n1. Circle the silent letters in each word. Remember, these letters should be seen and not heard!\n1. Knife\n2. Wristwatch\n3. Honest\n4. Psychology\n5. Autumn",
    "page_type": null,
    "pdf_page_no": 46,
    "book_page_no": 42,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/46.jpeg"
  },
  {
    "text": "2. Read the paragraph below and circle all the words with silent letters.\n\nOnce upon a time in the calm town of Taleemabad, there was a knight who knew how to knit very neatly. In his castle, the knight had a ghost as a guest. The ghost didn't like to gnaw on the tough doughnuts that the knight offered. Instead, the ghost sighed softly and longed for a light, high feast. The knight thought hard and finally made a delicious feast with whole wheat bread, lamb chops, and herbal tea. The ghost was delighted with the knight's kind gesture and the silent halls echoed with their laughter.\n\nActivity 3: Vowel-Consonant Concert \nObject: illustration of a smiling emoji with music notes around.\nIn word families, the words rhyme because they have the same vowel and consonant pattern at the end. If we take the final 'y' as a vowel, it sounds like 'ee'.\n\nExample, \n\"Sunny,\" \"funny,\" and \"bunny\" are all in the same happy word family!\n\nExercise:\nFill-in-the-blank questions to practice the vowel-consonant concept with 'y' sounding like 'ee':\n1. The little baby puppy is very _________.\n    (Hint: opposite of 'sad')\n2. She found some _________ in her pocket.\n    (Hint: what you use to buy things)\n3. My brother is so _________, he always tells us jokes.\n    (Hint: someone who makes people laugh)\n4. After the party, my room was very _________.\n    (Hint: opposite of clean)",
    "page_type": null,
    "pdf_page_no": 47,
    "book_page_no": 43,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/47.jpeg"
  },
  {
    "text": "\\nActivity 4: Digraphs and Blends Balloons\\nDigraphs are two letters that make one sound, like \"sh\" in \"ship\".\\nBlends are two letters that are said quickly together, like \"br\" in \"bread\".\\n\\nExample, \"This shiny whale is cheerful.\"\\nChoose the correct digraph or blend from the box to complete each word. Write it down in the space provided.\\nDigraphs\\/Blends Box: th, sh, ch, wh, sw, sn, sk, bl, br, cl, cr, dr, fl, gl, pl, pr, sl, sm, sp, st, tr, tw, qu\\n1. Please ___isper quietly and don't ___out in the library.\\n2. The pirate had a ___easure map that marked the spot with an X.\\n3. The magician's ___ick with the quarter was amazing!\\n4. The ___oken vase was on the floor, and I had to ___ue it back together.\\nBonus Challenge:\\nCan you think of a new word for each digraph or blend in the box?\\n\\nActivity 5: Synonyms and Antonyms\\nSynonyms are words that mean the same thing, and antonyms are opposites. It's like having a rainbow of words to choose from!\\nSynonyms: \"The cat walked and then started to strut.\"\\nAntonyms: \"The ancient castle was opposite the modern building.\"",
    "page_type": null,
    "pdf_page_no": 48,
    "book_page_no": 44,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/48.jpeg"
  },
  {
    "text": "Change one word in each sentence with a synonym (a word that means the same thing) or an antonym (a word that means the opposite). It's like giving the sentence a mini-makeover!\n\nHere are the sentences from our story:\n1. \"In the heart of Taleemabad, the sun rose over a morning filled with digital excitement.\"\n2. \"Pinky, always curious and adventurous, was brimming with ideas.\"\n3. \"Jojo muttered, looking at his worn-out maths workbook fondly.\"\n4. \"These tablets are doorways to a world of knowledge.\"\n5. \"They make learning alive!\"\n\nPunctuation Pit Stop\nObject: A smiling emoji holding a stop sign with text explaining punctuation rules.\nWe use a full stop (.) at the end of sentences and with some abbreviations like \"Mr.\" A hyphen (-) connects words in a compound word like \"mother-in-law.\" Also, We use abbreviations for titles like Ms. and Mrs., and for periods like months and days of the week.\n\nObject: An example matching exercise where the user must draw a line from the full word to its abbreviation, with a sample showing \"Dr. Ali wakes up at 6 a.m. - that's early!\"\nFull Words\nDoctor\nMister\nJanuary\nSaturday\nAfternoon\n\nAbbreviations\n1. Mr.\n2. Dr.\n3. p.m.\n4. Sat.\n5. Jan.",
    "page_type": null,
    "pdf_page_no": 49,
    "book_page_no": 45,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/49.jpeg"
  },
  {
    "text": "Chapter 4\nThe Great Debate\n\nHyphen Hunt \nCircle the compound words and then rewrite them correctly with a hyphen.\n1. The well known author signed books at the fair. ______________\n2. The eight year old boy won the spelling bee. ______________\n3. That is a high quality toy aeroplane. ______________\n4. We set up a lemonade stand in the backyard ______________\n\nobject: Illustration of three children and various objects (a house, sun, clouds) in an activity scene, associated with the 'Hyphen Hunt' exercise.\n\nImagination Canvas\n\nHello, creative minds! It's time to paint a picture with our words. Let's wrap up our tech tale with your thoughts and feelings.\n\n1. Your Creative Mission:\nThink about everything we've learned and discussed in the chapter - the excitement of new technology, the different opinions in the debate, and how we can use technology wisely.\n\n2. Draw a Big Picture:\nOn a blank page in your book, draw a scene from our Taleemabad tech adventure.",
    "page_type": null,
    "pdf_page_no": 50,
    "book_page_no": 46,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/50.jpeg"
  },
  {
    "text": "\\nWrite Your Reflection:\\nBelow your drawing, write a few sentences to conclude what you think about using technology in school. Here are some questions to help you:\\n- What was the most exciting part of our tech talk?\\n- How do you feel about using technology for learning?\\n- What's one important thing you would tell someone about technology in schools?\\nObject: A drawing of two kids engaging with technology; upper part shows a boy presenting in front of a screen with text and shapes, lower part shows a girl looking at a tablet, both within a classroom setting.\\n\\nConnect and Create\\nHey amazing explorers! Now it's time to create something special - a Tech Time Capsule! Inside, we'll put our thoughts about technology in education. But first, let's learn how to build an argumentative paragraph.\\n\\nCrafting Your Argument:\\nAn argumentative paragraph presents your opinion and tries to convince others that it's a good one. It's like building a sandwich of ideas where your opinion is the tasty filling!",
    "page_type": null,
    "pdf_page_no": 51,
    "book_page_no": 47,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/51.jpeg"
  },
  {
    "text": "Chapter 4\nThe Great Debate\n\nState Your Opinion:\nThis is like the top slice of bread. Tell your readers what you believe about technology in classrooms.\n\nGive Your Reasons:\nThese are the layers of lettuce, tomato, and your favourite sandwich fillings! Provide reasons why you think technology is beneficial or distracting in schools.\n\nSupport with Examples:\nAdd some tasty sauce to your sandwich! Use examples from the story we read or your own experiences.\n\nConclude Your Argument:\nFinish off with the bottom slice of bread. Sum up your opinion and leave your readers something to think about.\n\nYour Time Capsule Task:\nWrite your own argumentative paragraph about whether you think we should have more technology like tablets and computers in our classrooms.\nObject: Illustration of a woman standing next to an interactive digital board displaying various multimedia icons, a male character burying a time capsule in the ground, and another female character using a tablet, all portraying different aspects of technology in the educational context.",
    "page_type": null,
    "pdf_page_no": 52,
    "book_page_no": 48,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/52.jpeg"
  },
  {
    "text": "\\n5 Journey of a Plastic Bottle\\n\\nExplorer's Pathway\\nTake turns to speak on a range of topics of their own choices.\\nDifferentiate between rhetorical patterns while listening (e.g., stress and intonation in an imperative statement: \\\"You must clean your room\\\", as opposed to a question: \\\"Will you clean your room?\\\").\\nParticipate in group discussions, presentations and debates.\\nIndicate differences in proximity to speaker i.e.: this/that, these/those (e.g., This book belongs to her.)\\nApply phonic/spelling, graphic, grammatical and contextual knowledge in reading unfamiliar words and sentences. Read with some expression and clarity.\\nStart reading the story, poetry, and information books noting how text is organised into sections or chapters.\\nIdentify different types of non-fiction text and their known key features e.g., how persuasive language is used to convince a reader.\\nIdentify, differentiate between, and use some simple pairs of words including homophones(e.g., eight-ate, I-eye, two-too-to, their-there).\\nCorrectly use frequently confused words (e.g., to, too, two; there, their, they're).\\nUse knowledge of the meaning of individual words to predict the meaning of compound words (e.g., birdhouse, lighthouse, housefly; bookshelf, notebook, bookmark).\\nDistinguish between four type of sentence i.e. Declarative: I have a football match tonight. Exclamatory: We won the match! Interrogative: What are you doing, is it raining? Imperative: Complete your work.\\nWrite multiple paragraphs on a single topic (on the given text types), using correct capitalisation, punctuation and spelling, by using the process approach - brainstorm, mind mapping, writing a first draft, seeking peer feedback, developing a final draft.\\nInsert at least one dialogue or exclamation of emotion to add richness to the story. (For example: \\\"Hurrah!\\\" Sarah shouted when she won the game.)\\n\\nWrite simple descriptive paragraphs (giving general description of a person/object), using correct capitalisation, punctuation and spelling, by using the process approach - brainstorm, mind mapping, writing a first draft.",
    "page_type": null,
    "pdf_page_no": 53,
    "book_page_no": 49,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/53.jpeg"
  },
  {
    "text": "\\nMemory Lane\\nHello friends! Are you ready to explore an amazing journey today? Before we start, let's play a little guessing game about our story! Can you guess what our story might be about by looking at this picture? What journey could a small plastic bottle go on?\\nWho do you think will find the bottle first, and where will it travel?\\nObject: Illustration of a girl thinking about a plastic bottle's journey with a thought bubble showing a magnifying glass looking at a small plastic bottle.\\n\\nNew words to know\\nquench\\nto satisfy your thirst by drinking\\ndispose\\nto throw away or get rid of something properly\\nlitter\\nto drop trash on the ground instead of putting\\nit in a trash can\\nintruder\\nsomething or someone that is in a place where\\nthey don't belong\\nActivity: Environmental Charades\\nLet's play a game of charades with our new words to see if we can guess them without speaking! You'll act out each word, and your classmates will guess which word it is.",
    "page_type": null,
    "pdf_page_no": 54,
    "book_page_no": 47,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/54.jpeg"
  },
  {
    "text": "\\n\\nJourney through the text\\n\\nJourney of a Plastic Bottle\\nIn the bustling city of Taleemabad, among the lively streets filled with the sounds of children playing, a plastic bottle began its unexpected journey. It was just an ordinary bottle, one that Pinky had used to quench her thirst after a long day of outdoor activities. She didn't think much of it as she placed it beside a park bench, her mind already wandering to the next adventure.\\n\\nThe bottle lay there, forgotten, as the sun dipped below the horizon. That night, a gust of wind swept through the park, nudging the bottle onto a path it never expected to take.\\n\\nThe next morning, the bottle found itself by the roadside, rolling with every breeze, moving further away from the park. It was here that Jojo spotted it. \"Look, Pinky, isn't that your bottle?\" he asked, his voice a mix of curiosity and concern.\\n\\nPinky looked at the bottle, now covered in dust. \"Oh no, Jojo, we must always dispose of our rubbish properly. Let's pick it up and recycle it,\" she exclaimed, but before they could reach it, a street dog, wagging its tail, playfully hit the bottle with its paw, sending it into the drain.\\nObject: Illustration of children playing with a ball, a girl holding a water bottle, and a street dog.",
    "page_type": null,
    "pdf_page_no": 55,
    "book_page_no": 48,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/55.jpeg"
  },
  {
    "text": "Journey of a Plastic Bottle\n\nObject: Icon of a bottle with a question mark.\nWhat do you think will happen to the bottle next?\nAs the bottle journeyed through the drain, it was carried by the water through the dark tunnels beneath Taleemabad. It emerged in a stream, joining other pieces of litter, forming a small but growing island of waste.\n\nDays turned into weeks, and the bottle was swept into a river. Fish swam around it, confused by this intruder in their home. Birds pecked at it, mistaking it for food. The bottle, once useful, had now become a problem.\nObject: Illustration of river with fish, birds, and the problematic bottle.\n\nObject: Icon of a person with an exclamation mark.\nCan anyone tell me how the bottle is affecting the animals in the river?\nThe bottle's journey did not end in the river. The river's currents were strong, and they carried the bottle all the way to the sea. Here, the bottle saw the vastness of the ocean and the diversity of life it held. Turtles, dolphins, and so many fish! But it also saw the harm that bottles like itself were causing. The bottle felt sorry, wishing it had never left the park.\n\nOne day, a group of children came to the beach for a cleanup. They were students of Sir Riaz, who had taught them about the importance of keeping the environment clean. Among them was Pinky, who was leading the group, and Jojo, who carried a large bag for the recyclables. They picked up the bottle, along with many others, and made sure they were properly recycled this time.\nObject: Illustration of children cleaning the beach, featuring turtles, a dolphin, and another child.",
    "page_type": null,
    "pdf_page_no": 56,
    "book_page_no": 52,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/56.jpeg"
  },
  {
    "text": "\\nWhat lesson have we learned from the journey of Pinky's bottle?\nThe children of Taleemabad learned an important lesson that day. The plastic bottle, which once held a refreshing drink, could cause so much harm to the environment and living creatures. Pinky and Jojo made a pact to avoid using plastic bottles and to always recycle. They shared this lesson with their friends, teaching them to use reusable bottles and to always think about where their rubbish might end up.\n\nFrom that day forward, the city of Taleemabad became cleaner, and the children took pride in looking after their shared home, the Earth.\nObject: Illustration of three children with different skin tones, each holding a signage-related recycling. The first child, with a green recycling logo on the shirt, holds a sign. The second child has purple hair and holds a sign that reads with a thought bubble of a plastic bottle and a \"no\" symbol, reflecting a no plastic message. The third child, with yellow hair and a recycle logo t-shirt, holds a thought bubble with a tree symbolizing environmental consciousness.\n\\nDiving deeper\n\\nActivity 1: Comprehension Questions\n\\nCan you remember the details of our story? Let's put on our detective hats and dive back into the tale to find some clues!\n\n1. What was the first place the plastic bottle ended up after leaving the park?\n\n2. Which animal in the story mistook the bottle for food?",
    "page_type": null,
    "pdf_page_no": 57,
    "book_page_no": 53,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/57.jpeg"
  },
  {
    "text": "3. How did Pinky and Jojo finally dispose of the bottle properly?\n\n4. What important lesson did the children of Taleemabad learn about plastic bottles?\n\nActivity 2: Echoes of the Environment\n\nNow that we've answered some questions, let's think about why stories like these are important, can you identify the ways in which the author convinces us to care about our planet?\n\nActivity 3: Talking About Recycling\n\nIn groups, discuss how the story of the plastic bottle might persuade someone to recycle. Remember to look for persuasive phrases in the text that encourage environmental action. Object: Illustration of a cartoonish female figure standing near a chalkboard, with various shapes like rectangles and clouds around her.\n\nActivity 4: Message in a Bottle\n\nIt's time to decode the message that the story of the wandering bottle was trying to share with us. What do you think it was?",
    "page_type": null,
    "pdf_page_no": 58,
    "book_page_no": 54,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/58.jpeg"
  },
  {
    "text": "Write a short message that you believe the story conveyed about the environment.\n\nShare and Sparkle\n\nActivity 1: Chatterbox Challenge\n\nIt's time to shine, friends! Let's talk about what we can do to keep Taleemabad beautiful and share our ideas with each other\n\n\"Each of you can take turns to talk about one thing you can do to help our environment. It could be anything from planting a tree to turning off the lights when you leave a room.\" Students form a circle. A 'talking object' is passed around, and only the person holding the object may speak. They share one idea about helping the environment.\n\nObject: Illustration of a teacher holding a drink and waving, with environmentally friendly scenes such as clean and dirty areas of a beach. Students in a circle, one holding a 'talking object', discussing environmental ideas.",
    "page_type": null,
    "pdf_page_no": 59,
    "book_page_no": 55,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/59.jpeg"
  },
  {
    "text": "\"Please open your books to page five.\"\nObject: Icon of a person speaking with a speech bubble.\n\nReflect\nIf this is said with a firm tone, is it a command or a question? Show thumbs up for a command, thumbs down for a question.\n\nReflect\n\"Could you help me carry these books?\"\nObject: Icon of a person speaking with a speech bubble.\n\nIf this is said with a rising tone at the end, is it a command or a question? Show thumbs up for a command, thumbs down for a question.\n\nReflect\n\"Remember to put your name on your drawing.\"\nObject: Icon of a person speaking with a speech bubble.\n\nIf this is said with a serious and direct tone, is it a command or a question? Show thumbs up for a command, thumbs down for a question.\n\nReflect\n\"Do you think we should plant a tree here?\"\nObject: Icon of a person speaking with a speech bubble.\n\nIf this is said with a tone that goes up at the end, making it sound unsure, is it a command or a question? Show thumbs up for a command, thumbs down for a question.\n\nReflect\n\"Turn off the lights before you leave the room.\"\nObject: Icon of a person speaking with a speech bubble.\n\nIf this is said with a stern and clear tone, is it a command or a question? Show thumbs up for a command, thumbs down for a question.",
    "page_type": null,
    "pdf_page_no": 60,
    "book_page_no": 56,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/60.jpeg"
  },
  {
    "text": "Activity 1: This or That Theatre\n\nLet's play a game to learn about 'this' and 'that'. I will show you an object, and if it's close to me, you say 'this'. If it's far, you say 'that'. Ready?\nObject: Illustration of a young girl sitting on a rug, surrounded by various items like an umbrella, ball, pencil, drink, and plant, to demonstrate the use of 'this' and 'that'.\n\nGrammar Playground\n\nWelcome to Pinky's Word Carnivall Now we're going to play with words that sound the same but have different meanings and spellings. We'll also build a word wonderland with compound words and juggle with different kinds of sentences!\n\nHomophones are words that sound the same but are spelled differently and have different meanings, like 'eight' which is a number, and 'ate' which means you have had something to eat!",
    "page_type": null,
    "pdf_page_no": 61,
    "book_page_no": 57,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/61.jpeg"
  },
  {
    "text": "\\nActivity 1: Homophones Hoopla\\nChoose the correct word: \"I can't believe you ate (ate/eight) all the cupcakes!\"\\n1. Please ________ (quiet/quite) during the movie so everyone can hear.\\n2. The cat ________ (laid/lade) in the ________ (sun/son).\\n3. She tied a ________ (knot/not) in the rope to make sure it was secure.\\n\\nActivity 2: Confusing Words Carousel\\nFill in the blanks below.\\nSome words are tricky; they sound similar but have different uses. 'To' is used for direction, 'too' means also, and 'two' is the number after one. Let's not mix them up!\\n\\nExample, I am going to the market to buy two mangoes.\\n1. The ________ (flower/flour) is the main ingredient for making bread.\\n2. The ________ (sea/see) is so calm today; you can ________ (sea/see) all the way to the horizon.\\n3. After the rain, there were ________ (pair/pare/pear) shaped puddles on the ground.\\n\\nActivity 3: Compound Word Construction Site\\nWhen we put two words together to make a new one, like 'bookshelf', it's called a compound word. It's like building a new toy from two smaller ones!\\nExample, 'book' + 'case' = bookcase.",
    "page_type": null,
    "pdf_page_no": 62,
    "book_page_no": 58,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/62.jpeg"
  },
  {
    "text": "1. What does 'firefly' mean? Choose the right answer:\na. A fly that is on fire.\nb. A small insect that glows in the dark\n\nWhat does 'rainbow' mean? Choose the right answer:\na. A bow that rains.\nb. Coloured arch in the sky after rain.\n\nWhat does 'starfish' mean? Choose the right answer:\na. A fish shaped like a star.\nb. A sea creature with a star-shaped body.\n\nWhat does 'sunflower' mean? Choose the right answer:\na. A flower that looks like the sun.\nb. A tall plant with large yellow flowers that turn toward the sun.\n\n3. Create a compound word:\na.\"tooth\" + \"brush\" = ____________.\nb. \"butter\" + \"fly\" = ____________.\n\nActivity 4: Sentence Spectacle\nSentences can tell us something, show strong feelings, ask a question, or give commands. They are declarative, exclamatory, interrogative, or imperative\n\nExample\nDeclarative (tells us something):\nThe sky is blue. (This sentence declares a fact.)\nObject: Decorative illustration labeled \"Example\" near the text about sentence types.",
    "page_type": null,
    "pdf_page_no": 63,
    "book_page_no": 59,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/63.jpeg"
  },
  {
    "text": "\\nExample, Exclamatory (shows strong feelings): What a beautiful day! (This sentence expresses excitement or a strong emotion.)\\n\\nExample, Interrogative (asks a question): Where is my book? (This sentence asks for information.)\\n\\nExample, Imperative (gives a command): Please sit down. (This sentence gives a direction or command.)\\n\\nComplete the following questions.\\n\\nIdentify the sentence type: \"I have a new puppy at home.\"\\n\\nWrite an exclamatory sentence about winning a game.\\n\\nTurn the statement into a question: \"You like chocolate.\"\\nObject: Illustration of a girl holding a balloon with tables below labeled \"Homophones,\" \"Compound Words,\" \"Declarative Sentences,\" \"Exclamatory Sentences,\" \"Interrogative Sentences,\" and \"Imperative Sentences.\"",
    "page_type": null,
    "pdf_page_no": 64,
    "book_page_no": 60,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/64.jpeg"
  },
  {
    "text": "Chapter 5\nJourney of a Plastic Bottle\n\nImagination Canvas\n\nObject: Illustration of a character with a thinking bubble, labeled \"Imagine\".\nNow it's your turn to create a story! Remember our journey with the wandering bottle? Let's write a tale about how we can make Taleemabad the cleanest city ever!\n\nActivity: Taleemabad's Clean Sweep\n\n1. Brainstorming:\nThink of ideas for making Taleemabad cleaner. What can everyone do? Draw or list your ideas on a mind map.\n\n2. Writing a First Draft:\nChoose the best ideas from your mind map and start writing your story. Remember to describe the setting, the characters, and what they do.\n\n3. Peer Feedback:\nSwap stories with a classmate. Read theirs and let them read yours. Give each other kind and helpful ideas on how to make the story better.\n\n4. Developing a Final Draft:\nUse your classmate's feedback to make your story even better. Check your capital letters, full stops, and spellings.\n\n5. Adding Dialogue and Emotion:\nHave your characters speak to each other. Add at least one exclamation of emotion, like \"Wow!\" or \"Yuck!\" to show how they feel.",
    "page_type": null,
    "pdf_page_no": 65,
    "book_page_no": 61,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/65.jpeg"
  },
  {
    "text": "Chapter 5\nJourney of a Plastic Bottle\n\nExample Starters:\n\"One sunny morning in Taleemabad, Ali found a pile of litter by the river...\"\n\"In the heart of Taleemabad, Sara had an idea: 'What if we...'\n\"Hurrah! We've done it!\" cheered the children of Taleemabad as they looked at their clean park.\"Object: Illustration of children in various activities including cleaning up a park, looking at a book, and throwing trash in a bin.\n\nConnect and Create\nIt's project time! We are going to make our own environmental diaries. This will be a record of all the wonderful things we do to help our planet!\n\nMini Project: \"My Green Actions\"\nPinky's Guide to Crafting Your Diary:\nOrganising Thoughts:\nUse a mind map to brainstorm daily actions you can take to help the environment.",
    "page_type": null,
    "pdf_page_no": 66,
    "book_page_no": 62,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/66.jpeg"
  },
  {
    "text": "\\nDiary Sections:\\nDivide your diary into sections such as 'Recycling', 'Saving Water', and 'Planting Trees'.\\n\\nFirst Draft:\\nStart with one section of your diary. Describe what you did, how you did it, and how it helps the environment.\\n\\nDescriptive Writing:\\nFor each section, write a paragraph describing an action you took. For example, \"Today, I planted a sunflower in my garden. It has bright yellow petals and a big, brown centre.\"\\n\\nPinky's Tip:\\nDon't forget to use exciting words and check your sentences for capital letters and full stops!\\n\\nExample Diary Entry:\\n\"Recycling Adventures: I found five plastic bottles and put them in the blue recycling bin outside our house. The bin was almost full!\"\\nObject: Illustration of a character depositing bottles into a recycle bin and various environmental icons around (flowers, sun, recycling symbols, water drops).",
    "page_type": null,
    "pdf_page_no": 67,
    "book_page_no": 63,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/67.jpeg"
  },
  {
    "text": "6\nAllama Iqbal's (\n\n\n) visit to Taleemabad\n\nExplorer's Pathway\n\nListen and understand longer conversations from different contexts, short lectures and talks, radio and TV broadcasts, stories, and descriptions of events and will be able to identify main ideas.\nObject: Illustration depicting a speech bubble with an icon representing conversation.\nEnact a short drama/play script showing different roles and scenarios through deliberate choice of dialogues/speech, gestures, and movements.\nExplore the different processes of reading silently and reading aloud.\nExplain how paragraphs and chapters are used to organise ideas.\nRead newspaper reports, posters, flyers and consider how they engage the reader.\nObject: Illustration of an eye looking at various types of media such as newspapers and flyers.\nRetell or paraphrase events from the text in response to questions.\n\nExplain the meaning of simple similes and metaphors (e.g., as pretty as a picture) in context.\nUse some common similes in speech and writing using 'like'.\nUse the degrees of adjectives in sentences with more and most.\nUse simple present verbs to show habitual actions, universal statements, and current facts in sentences and paragraphs.\nWrite the first draft and then edit it.\n\nIntroduce a topic and group related information together; include illustrations when useful to aid comprehension.\na. Develop the topic with facts, definitions, and details.Write the first draft and then edit it.\nb. Use linking words and phrases (e.g. also, another, and, more, but) to connect ideas within categories of information.\nc. Provide a concluding statement.",
    "page_type": null,
    "pdf_page_no": 68,
    "book_page_no": 64,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/68.jpeg"
  },
  {
    "text": "Memory Lane\n\nNew words to know\nbewildered\nfeeling very confused\nbehold\nto see or look at something\nablaze\non fire; glowing with light or excitement\nlegacy\nsomething from the past that affects the present or future\n\nActivity: Time Capsule Sentences\nCan you use these new words in a sentence? Imagine you're showing Allama Iqbal (\\u0627\\u0644\\u0639\\u0644\\u0627\\u0645\\u0627 \\u0627\\u0642\\u0628\\u0627\\u0644) something from today's world\n1. bewildered ________\n2. behold ________\n3. ablaze ________\n4. legacy ________\nObject: Illustration of different modern items like a car, a rocket, a laptop, and a smartphone, presented as a 'Time Capsule Activity.'",
    "page_type": null,
    "pdf_page_no": 69,
    "book_page_no": 65,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/69.jpeg"
  },
  {
    "text": "Chapter 6\nAllama Iqbal's visit to Taleemabad\n\nJourney through the text\n\nAllama Iqbal's (\\u202b\\u0627\\u0644\\u0644\\u06c1\\u0645\\u0627\\u0621 \\u0627\\u0642\\u0628\\u0627\\u0644\\u202c) visit to Taleemabad\n\nSetting:\nModern-day Taleemabad, in the bustling central square, full of life and the echoes of history. Suddenly, a mysterious whirl of wind appears, and out steps Allama Iqbal (\\u202b\\u0627\\u0644\\u0644\\u06c1\\u0645\\u0627\\u0621 \\u0627\\u0642\\u0628\\u0627\\u0644\\u202c), slightly bewildered but with a sense of purpose.\n\nCharacters:\nObject: The visionary poet, dressed in traditional attire, with an aura of wisdom.\nObject: An energetic and curious young girl, the embodiment of modern youth.\nObject: Pinky's contemplative brother, with a sharp mind and a caring heart.\nObject: The guiding teacher, always encouraging understanding and reflection.\n\n[The wind settles, and Allama Iqbal (\\u202b\\u0627\\u0644\\u0644\\u06c1\\u0645\\u0627\\u0621 \\u0627\\u0642\\u0628\\u0627\\u0644\\u202c) finds himself in the new world, his gaze sweeping across the vibrant cityscape.]\nThis landscape... it whispers of progress and echoes with the footsteps of the future.\nYou're in Taleemabad, sir! It's like you travelled through time!\nThe Poet of the East, in our time? What wisdom do you seek to impart?\n[With a warm smile] I have crossed time to witness the seeds I once sowed in hearts and minds.",
    "page_type": null,
    "pdf_page_no": 70,
    "book_page_no": 66,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/70.jpeg"
  },
  {
    "text": "Allama Iqbal's visit to Taleemabad\nYour words have crossed generations, Allama Iqbal (\\u0627\\u0644\\u0645 \\u0625\\u0642\\u0628\\u0627\\u0644). Students, his vision for you remains timeless.\nObject: Illustration of Allama Iqbal with children showing their excitement and admiration around him.\nWhat feelings stir within you as you behold the future of your dreams?\n[Pinky and Jojo eagerly lead Allama Iqbal (\\u0627\\u0644\\u0645 \\u0625\\u0642\\u0628\\u0627\\u0644) through the town, pointing to the marvels of modernity, the schools, the libraries, and the parks.]\nWe learn of your vision, to stir the soul towards higher aspirations. We strive, we dream, and we rise!\n[Nodding appreciatively] The Falcon soars not because it is free of the earth, but because it knows no limit to the sky. How do you, the youth, prepare to soar?\nWe gather knowledge, we build our strengths, and we dream not just for ourselves but for all.\nObject: Illustration of a classroom scene with children and Allama Iqbal, emphasizing the theme of education and aspiration.",
    "page_type": null,
    "pdf_page_no": 71,
    "book_page_no": 67,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/71.jpeg"
  },
  {
    "text": "Allama Iqbal's visit to Taleemabad\n\nHow does Allama Iqbal's (  ) metaphor of the \"Falcon\" inspire you in your pursuits?\n\n[They come across a group of children engaged in a community clean-up, their actions painting a picture of unity and responsibility.]\nObject: image of a group of children cleaning with saplings and dirt around.\n\n[Observing their teamwork] In unity, there is strength. In faith, there is light and purpose. In discipline, there is honour and progress. Do these values guide you today?\n\nYes, we stand united, our faith unwavering, our actions disciplined as we work towards a future that honours your dreams.\n\nWhy are the principles of unity, faith, and discipline vital in our journey forward?\n\n[The scene shifts to a technology-equipped classroom where children are engaged in learning about history, science, and literature.]\nObject: image of a diverse group of kids sitting at desks with technological devices, books, and educational posters around the room.\n\n[Inspired by the sight] This is where kids gain knowledge and start to become future leaders.\n\nAnd we will be those leaders, building on the foundation you laid.\n\n[With approval] Then my heart is at ease, for the torch of knowledge is ablaze in capable hands.\nObject: image of multiple children of diverse appearances involved in conversation, some standing, some sitting, with trees and a blue sky in the background.",
    "page_type": null,
    "pdf_page_no": 72,
    "book_page_no": 68,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/72.jpeg"
  },
  {
    "text": "Chapter 6\nAllama Iqbal's visit to Taleemabad\nWe are grateful, Allama Iqbal (  ), for your enduring legacy, which continues to light our way.\nHow will we carry Allama Iqbal's (  ) legacy into our future deeds and dreams?\n\nDiving Deeper\nLet's explore what we've learned. Ready to become detectives of history?\n\nActivity 1: Answer the following questions.\n1. What was the first thing Allama Iqbal (  ) did when he arrived in Taleemabad?\n2. Who were the two children that Allama Iqbal (  ) talked to, and what did they discuss?\n3. What did Allama Iqbal (  ) say about the Falcon, and what does it mean?\n4. How did the children in the park show unity, faith, and discipline?\n5. What was the reaction of the class when Allama Iqbal (  ) visited them?\n\nActivity 2: Reflective Replay\nPonder over the play we've just read. What thoughts and words stand out to you about Allama Iqbal's (  ) message? Write down three to four keywords that resonated with them from the play script, reflecting on his vision and their role in the future.",
    "page_type": null,
    "pdf_page_no": 73,
    "book_page_no": 69,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/73.jpeg"
  },
  {
    "text": "\\nActivity 3: Fill in the blanks\nUh oh! Some of the words lost their letters! Help me put them back together.\n1. di___ipl___\n2. ___ur________\n3. s___r____gt\n4. o___n____at_______\nobject: Illustration of a girl with a book surrounded by thought bubbles containing a book, school building, and smaller bubbles.\n\\nShare and Sparkle\n\\nMini Drama Activity 1: Allama Iqbal's (\\u0632\\u0646\\u062f\\u063a\\u06cc) Echo\nIt's showtime, friends! Let's bring our play to life. Remember, it's not just what we say but how we say and show it that tells the story!\n\\nPinky's Performance Points\nThe Arrival:\nStudents pair up; one acts as Iqbal, stepping into the modern world with a look of wonder, and the other as Pinky, greeting him with a cheerful wave.\nThe Lesson:\nIn groups, students act out Iqbal sharing his message through poetry.\nThe Discussion:\nSmall groups enact the scene where Iqbal and the children talk about the Falcon. Encourage them to use gestures like pointing to the sky when mentioning the Falcon.",
    "page_type": null,
    "pdf_page_no": 74,
    "book_page_no": 70,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/74.jpeg"
  },
  {
    "text": "The Vision:\nEach student takes a turn to say one line from Iqbal's vision for the future, using expressive hand movements to show their commitment to that vision.\nObject: Illustrations of various students participating in the activity, each displaying a different scene related to the vision mentioned.\n\nGrammar Playground\nLanguage detectives, are you ready to uncover the secrets of similes, metaphors, and more? Let's investigate!\n\nActivity 1: Simile\n\"Similes are like magic keys that unlock vivid pictures in our minds. They compare two things using 'like' or 'as'. For example, 'as busy as a bee' means very busy, because bees are always buzzing around doing work'\"\nObject: Example description in a framed text box: 'She was smiling like the sun - The water in the lake was as clear as a crystal.'",
    "page_type": null,
    "pdf_page_no": 75,
    "book_page_no": 71,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/75.jpeg"
  },
  {
    "text": "Chapter 6\nAllama Iqbal's visit to Taleemabad\n\nAnswer the following questions.\n\n1. Fill in the blanks.\n1. He runs as __________ a cheetah.\n2. The water in the pool was as cold as __________.\n3. During the summer, the flowers smell as sweet as __________.\n\n2. Select if the following statements are true or false.\nExample, As tall as a mouse\" is a good simile for someone very tall.\nAnswer: False.\n1. The pillow was as hard as stone\" is a good simile for a very soft pillow. T/F\n2. The night sky was as bright as noon\" is a good simile for a very dark night. T/F\n3. He was as brave as a lion\" can describe someone who is very courageous. T/F\n\n3. Create your own simile:\n1.\n\n2.\n\n3.\n\nActivity 1: Adjective Adventure\n\nAdjectives describe things. When we compare them, we use 'more' for comparison and 'most' for the highest degree. Tall, taller, tallest' showing different degrees of height!\nExample, The tree in my garden is as tall as a house.",
    "page_type": null,
    "pdf_page_no": 76,
    "book_page_no": 72,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/76.jpeg"
  },
  {
    "text": "Chapter 6\nAllama Iqbal\\u2019s visit to Taleemabad\n\nObject: Decorative green frame around example text with a speaking bubble.\nExample, Pinky is the happiest girl in the class.\nPinky is more closer to her mother than anyone else.\n\nChoose the correct form.\n1. The sunflower is __________ (tall) than the daisy.\n2. That was the __________ (exciting) movie I\\u2019ve ever seen.\n3. My dog is __________ (friendly) than your cat.\n4. She is the __________ (intelligent) student in the class.\n5. This cake is __________ (delicious) than the one we had yesterday.\n\nActivity 2: Present Verbs Party\n\nSimple present verbs are used for things that happen all the time or are general facts. Like 'I walk to school every day' or 'The sun rises in the east.'\nObject: Decorative blue frame around example text with a speaking bubble.\nExample, Every Saturday, John __________ (play) soccer with his friends.\nAnswer: Every Saturday, John plays soccer with his friends.\n\n1. Every morning, Sarah __________ (brush) her teeth before breakfast.\n2. The bus __________ (arrive) at the station at 8:30 AM every day.\n3. Cats __________ (purr) when they are content.\n4. Water __________ (boil) at 100 degrees Celsius.\n5. She always __________ (read) a book before bedtime.",
    "page_type": null,
    "pdf_page_no": 77,
    "book_page_no": 73,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/77.jpeg"
  },
  {
    "text": "Imagination Canvas\n\nHello young adventurers! Today, we embark on a thrilling journey of imagination. Are you ready?\n\nActivity: Design Your Dream World Poster\nObjective: To express your vision for a better world.\n\nTask:\nImagine a world where everything is perfect, and everyone is happy. What does this world look like to you? Is it a clean and green planet, people helping each other, or something else?\n\nInstructions:\n\nIntroduce Your Topic:\nBegin by describing your dream world. What is it like, and why is it better than the world today?\n\nDevelop Your Topic:\nAdd details and facts to explain your vision. For example, if you want a happy and fun world, explain how it is important for everyone.\n\nUse Linking Words:\nUse words like \"also,\" \"another,\" \"and,\" \"more,\" or \"but\" to connect your ideas.\n\nProvide a Conclusion:\nWrap up your vision with a concluding statement. Share why your dream world is important.\n\nObject: Images of a hot air balloon and a smiling globe to symbolize adventure and global happiness respectively.",
    "page_type": null,
    "pdf_page_no": 78,
    "book_page_no": 74,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/78.jpeg"
  },
  {
    "text": "Allama Iqbal's visit to Taleemabad\n\nEdit Your Work:\nAfter writing your first draft, review it and make improvements.\nPinky's Tip: Feel free to add illustrations to your poster to make it even more exciting!\nObject: Illustration of a girl presenting a colorful poster with children engaged in various activities, while other children watch and have fun next to a text box containing the tip from Pinky.\n\nConnect and Create\n\nExplorers! Let's do a fun and engaging mini-project.\n\nMini Project: Reporter's Spotlight\n1. Task:\nImagine you're a reporter for a special news segment called \"Kids Investigate.\" Your task is to investigate and report on an interesting topic from your local area or community.\n2. Choose a Topic:\nSelect a topic of interest from your local area or community. It could be a local event, landmark, tradition, or an issue that you find fascinating.\n3. Research:\nGather information about your chosen topic from various sources. You can use newspapers, posters, flyers, or even interview local people who are knowledgeable about the topic.",
    "page_type": null,
    "pdf_page_no": 79,
    "book_page_no": 75,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/79.jpeg"
  },
  {
    "text": "Chapter 6\nAllama Iqbal's visit to Taleemabad\n\n- Create a News Report:\nWrite a short news report about your chosen topic. Include the following elements:\n- A catchy headline\n- An engaging introduction\n- Main details about the topic\n- Quotes from interviews (if applicable)\n- A conclusion\n\n- (Optional) Design a Poster:\nCreate a poster that shows your news report. Include relevant images, captions, and key points. Make it visually appealing and informative.\n\n- Presentation:\nPresent your news report and poster to your classmates. You can pretend to be a news reporter and use gestures and expressions to make it engaging.",
    "page_type": null,
    "pdf_page_no": 80,
    "book_page_no": 76,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/80.jpeg"
  },
  {
    "text": "7\nPinky and Jojo's\nCool-Down Adventure\n\nExplorer's Pathway\n\nSpeak confidently using varied vocabulary and tone to express, persuade, instruct, or offer advice to engage the listener. (e.g., talking about reports, articles, programmes,etc.)\n\nEngage in simple conversations that require performing everyday tasks and speech acts, such as introducing themselves and others, giving directions, making a call, making requests.\n\nAsk questions to obtain information and explain ideas clearly, making meaning explicit.\n\nUse imperative verbs in sentences i.e. Stay here, Run fast.\n\nDistinguish between similarly spelled words by identifying the sounds of the letters that differ.\n\nUse knowledge of punctuation and grammar to read age-appropriate texts with fluency, understanding and expression.\n\nRead and enjoy a variety of reading-age-appropriate and high-interest books and texts from print and non-print sources: Narratives (e.g., realistic and familiar stories, fairy tales, fables)\n\nWrite narratives in which they recount two or more appropriately sequenced events, include some details regarding what approach - brainstorming, mind-mapping first draft).\n\nIdentify paragraph as a larger meaningful unit of expression representing the unity of thought. Recognise and understand that: In a paragraph, sentences join to make sense in relation to each other through transitional devices.\n\nExpress understanding of the text in your own words.\n\nUse interrogative pronouns to make question sentences.\n\nDevelop an understanding of the participles -ing, -ed to differentiate between the meanings of adjectives.\n\nRecognise, articulate and use forms of common regular verbs, i.e. base, s/es, present participle (-ing), past, and past participle forms.\n\nUse and differentiate between regular verbs (walk/walked) and irregular verbs (drink/drank)\n\nUse the present continuous for actions taking place at some time in the past.\n\nMake simple sentences by using SV (subject and verb) and SVO (subject, verb, and object) pattern e.g., Alia cooks food.",
    "page_type": null,
    "pdf_page_no": 81,
    "book_page_no": 77,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/81.jpeg"
  },
  {
    "text": "Pinky and Jojo's Cool-Down Adventure\n\nMemory Lane\n\nNew words to know\nannoyed\nfeeling slightly angry or upset\ndeflate\nto let air out, making something less inflated\ninflating\nfilling something with air, causing it to expand\nhothead\nsomeone who gets angry easily\ndiminishing\nbecoming smaller, fewer, or less\ngrinning\nsmiling widely\n\nActivity: Word Workout\nUse these new words in a sentence that describes something you might do at a party: For example, 'I was grinning when I saw the huge cake'\nannoyed\ndeflate\ninflating\ndiminishing\ngrinning\nhothead\n1. I felt ______ when my little brother took my toy without asking.\n2. When you let air out of a balloon, it will ______ .\n3. We are ______ the balloons for the party.\n4. As we shared the cookies, they were quickly ______ .\n5. She was ______ from ear to ear when she received a present.\n6. He's such a ______ ; he gets angry over the smallest things\nObject: Illustration of two children, one wearing a hat with a \"hothead\" tag and both sitting in a cooling pool, decorated with party hats and flags.",
    "page_type": null,
    "pdf_page_no": 82,
    "book_page_no": 78,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/82.jpeg"
  },
  {
    "text": "Pinky and Jojo's Cool-Down Adventure\nSetting:\nThe sun-drenched playground of Taleemabad, with Pinky and Jojo sitting under the shade of a large tree, a little distance apart after a heated argument during a game.\nObject: Image of a sun logo at the top of the page.\n[Annoyed, arms crossed] Jojo, you always try to do everything yourself in the game! It's supposed to be a team effort!\n[Looking guilty] I'm sorry, Pinky. I was just trying to score. I didn't mean to upset you.\n[Sighs, trying to calm down] Ugh, it just made me so mad! I wanted to help the team, too.\nDad says it's okay to feel angry. But it's not okay to let it out by hurting others or ourselves.\nYeah, she talks about that 'deep breathing' thing... She says to imagine blowing up a big balloon in your belly when you breathe in...\nObject: Emojis of Pinky and Jojo positioned respectively with their dialogue. Pinky looking annoyed and crossed arms emoji; Jojo with a guilty expression emoji; both of them with a standard face emoji.\nand then slowly letting the air out to deflate the balloon when you breathe out. Want to try it with me?\n[They both take deep breaths, inhaling slowly and then exhaling, visualizing a balloon inflating and deflating.]\n[Breathes deeply] That actually feels better. What was that other thing she mentioned?\nWhen you're mad, count slowly to ten to give yourself time to cool off. Let's do it?",
    "page_type": null,
    "pdf_page_no": 83,
    "book_page_no": 79,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/83.jpeg"
  },
  {
    "text": "Chapter 7\nPinky and Jojo's Cool-Down Adventure\n\n[They count together, their anger visibly diminishing with each number.]\n\nObject: Illustration of a small boy and girl with angry faces.\n\n[More calmly] One... two... three...\n\nObject: Illustration of the small boy and girl looking less angry and counting together.\n\n[Continues counting] ...eight... nine... ten. Do you feel a bit cooler now?\n\nObject: Illustration of the boy and girl with calm expressions.\n\n[Nods] I do. Like after a big rainstorm. And I remember, Grandma also said to use 'I feel' statements instead of blaming others.\n\nSo instead of saying 'You never pass the ball!'...\n\nI can say, 'I feel left out when I don't get to play with the ball'. That way, I'm not pointing fingers.\n\n[Smiles] Exactly. And it helps me understand how you feel. I'm really sorry, Pinky. I'll make sure to pass the ball to you next time.\n\nObject: Illustration of the girl smiling.\n\n[Grinning] And I'll try to be less of a hothead. Thanks, Jojo. You're the best brother.\n\nObject: Illustration of the boy smiling and reacting to the girl's comment.\n\nWhy is it important to take deep breaths when we're angry?\n\nPinky used 'I feel' statements to express herself. Why is that better?\n\nWe all get mad sometimes, but there are cool ways to handle it. Like our balloon breathing!\n\n[Adds cheerfully] And remember, it's not about the mistake; it's about how we fix it. Let's keep practicing and be ready for the next game!",
    "page_type": null,
    "pdf_page_no": 84,
    "book_page_no": 80,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/84.jpeg"
  },
  {
    "text": "Pinky and Jojo's Cool-Down Adventure\n\n-Diving deeper\n\nPinky's Questions to Ponder:\n\nLet's think about what we learned. Ready to\ndig deep into our cool-down adventure?\n\n1. What did Jojo forget to do in the game that made me feel left out?\n\n2. What did Grandma suggest we do when we feel angry?\n\n3. How did the 'balloon' exercise help us manage our feelings?\n\n4. What phrase did I use to tell Jojo how I felt without blaming him?\n\n5. What did we decide to do after our argument to cheer up?\nObject: Illustrations of three characters, the first holding a red balloon to their chest, the second with hands over their heart, and the third pointing to a sign labeled \"COOL DOWN STEPS\".",
    "page_type": null,
    "pdf_page_no": 85,
    "book_page_no": 81,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/85.jpeg"
  },
  {
    "text": "Chapter 7\nPinky and Jojo's Cool-Down Adventure\n\nActivity 1: Pinky's Personal Insight\nAfter reading our story, what words come to mind about dealing with anger or making up after an argument? Jot down the keywords that resonate with you.\n\nWrite down three to four keywords that you found interesting in the dialogue, you think they help you in managing anger?\n1. _____________\n2. _____________\n3. _____________\n4. _____________\nObject: Illustration of a character with purple hair, holding a magnifying glass, alongside an illustration of two children conversing.\n\nActivity 1: Introduce Your Partner\nSpeaking up can be a sparkle of fun! Let's practice our conversation skills with some super simple activities.\nPair up with a classmate, learn three interesting things about them, and then introduce your partner to the class using those facts.\n\"Class, meet Ali. He loves to paint, he helps his dad in the garden, and he can solve a Rubik's Cube super fast!\"",
    "page_type": null,
    "pdf_page_no": 86,
    "book_page_no": 82,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/86.jpeg"
  },
  {
    "text": "\\nActivity 2: The Direction Game\nObject: Simple map of Taleemabad with post office and mango tree.\nDraw a simple map of Taleemabad, practice giving directions from one place to another, finally take turns with a friend to be the 'tour guide' and the 'tourist'.\nExample, \"Start at the post office, walk straight until you see the big mango tree, then turn left.\"\n\\nActivity 3: The Telephone Challenge\nPretend to make a phone call to order food for a party, use phrases like 'Could I order..?', 'How much is..?', and 'Thank you!'\nExample, \"Hello, could I order three large pizzas for Pinky's party? How much will that be?\"\n\\nActivity 4: The Question Quest\nWrite down one question you have about Taleemabad, then ask your question to a friend and listen to their answer. Next, swap roles and let them to ask you a question.\nExample, \"Why is Taleemabad park so famous?\"",
    "page_type": null,
    "pdf_page_no": 87,
    "book_page_no": 83,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/87.jpeg"
  },
  {
    "text": "Grammar Playground\n\nLet's play with words and turn them into questions, actions, and stories! Grammar can be a game, too\n\nActivity 1: Interrogative Pronouns\n\nInterrogative pronouns are the question words: who, what, where, when, why, and how. We use them to ask about things!\n\nAsk your partner the following questions, to understand how interrogative pronouns work!\n\n1. Who is your best friend at school?\n2. What is your favorite game to play during break?\n3. Where do you go after school each day?\n4. When do you do your homework?\n5. Why do you like your favourite book?\n6. How do you get to school every morning?\n\nActivity 2: Participles as Adjectives\n\nParticiples can be used as adjectives. An 'ing' adjective describes something ongoing, while an 'ed' adjective describes how someone feels.\n\nExample, Running through the park, she stumbled upon a hidden garden (run/running).",
    "page_type": null,
    "pdf_page_no": 88,
    "book_page_no": 84,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/88.jpeg"
  },
  {
    "text": "Pinky and Jojo's Cool-Down Adventure\n\nFill in the blank with the correct participle.\n\n1. The joke was so funny, I couldn't stop _____ (laugh/laughing).\n2. I am _____ (bore/bored) because the game was _____ (boring/bored).\n3. The _____ (exciting/excited) puppy chased its own tail.\n\nActivity 3: Regular and Irregular Verbs\n\nObject: Illustration of a circle icon containing two icons: a regular verb icon (a book with '-ed' symbol) and an irregular verb icon (a swirly arrow).\nRegular verbs add -ed for the past tense, like 'walk' becomes 'walked'. Irregular verbs change completely, like 'drink' becomes 'drank'.\n\nExample:\n- Yesterday, she jumped over the puddle.\n- They have gone to the zoo several times.\n\nFill in the blanks with the correct tense.\n1. Yesterday, I _____ (walk) to the park.\n2. I have never _____ (drink/drunk/drank) such sweet mango juice!\n3. This morning, she _____ (sing) a beautiful song.\n\nActivity 4: Continuous for Past Actions\n\nObject: Illustration of a circle icon with an internally depicted 'continuous action' symbol (run-time icon).\nSometimes we talk about the past as if it's happening right now. We use the present continuous with a past time word.\n\nExample: \"So there I am, walking down the street, minding my own business, when suddenly I see this huge dog running towards me.\"\n\nComplete the given sentences.\n1. I was _____ (eat/eating) dinner at 7 o'clock last night.\n2. They were _____ (play/playing) cricket when it started to rain yesterday.",
    "page_type": null,
    "pdf_page_no": 89,
    "book_page_no": 85,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/89.jpeg"
  },
  {
    "text": "Activity 5: Imperative Verbs\nImperative verbs give commands. They tell someone to do something, like 'Run!' or 'Listen!'\nExample, \"Please open the window.\"\n\nAnswer the given questions in your notebook.\n1. Write a command telling someone to be quiet in the library.\n2. Give a command to someone to look at the board in the classroom.\n3. Tell your friend to pass the ball in a football game.\n\nObject: Illustration of a thought bubble with images representing 'thinking' and 'speaking' adjacent to the text about imperative verbs.\n\nImagination Canvas\nObject: Illustration of a speech bubble asking, \"Can you tell a story about calming down when you feel really angry or super excited?\"\n\nActivity: Taleemabad's Clean Sweep\n- Think of a time when you felt really angry or excited.\n- Make a Plan: What happened first? What happened next?\n- Draw your ideas on paper.you'll be writing a mini-report about it.\n- Put it in Order: What came first? What came after? Make a path of your story on your paper.\n- Write it Out: Start telling your story. Write about what happened and how you felt.\n- Check Your Story: Read your story. Does it have a start, a middle, and an end?\nObject: Illustration showing a process map labeled with 'planning', 'drawing', 'writing', and 'checking', marking stages as START, MIDDLE, and FINISH.",
    "page_type": null,
    "pdf_page_no": 90,
    "book_page_no": 86,
    "page_figures": [
      "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_page_figures/1146/17731/90/b841090f-0eb3-4063-84c8-2763f2bc1758.jpeg"
    ],
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/90.jpeg"
  },
  {
    "text": "Connect and Create\n\nIt's project time! We are going to make our own environmental diaries. This will be a record of all the wonderful things we do to help our planet.\n\nActivity: Become a Book Explorer\n\nGoal:\nTo read a story and find out how it's put together.\n\nTask:\nChoose a short story you love - it could be a tale about animals, a fairy tale, or an adventure.\n\nWhat to Do:\nRead: Enjoy your story at home.\n\nDiscover Paragraphs: Notice how the story is split into parts - these are called paragraphs. Each one groups together ideas that belong with each other.\n\nDraw a Story Map: After reading, draw a map of your story's adventure. For each paragraph, draw a picture or write a few words about the main idea.\n\nShare: Bring your story map to class and tell us about your journey through the book.\nObject: Illustration of a story map with various story elements and a character, visually represented as a scrolling map.",
    "page_type": null,
    "pdf_page_no": 91,
    "book_page_no": 87,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/91.jpeg"
  },
  {
    "text": "\\n8 Reaching for the Stars\\n\\nExplorer's Pathway\\n1 Participate in group discussions, presentations and debates.\\n2 Talk confidently in extended turns and listen purposefully in a range of contexts.\\nDemonstrate attentive listening and engage appropriately with empathy and respect, taking into account opinions and ideas shared by others while developing their own.\\n3 Make questions starting with be form of verbs (e.g., Are you going to Lahore today?)\\n4 Read a wide range of books, drawing on background information and vocabulary provided.\\nRecognise the Wh-words as keywords in making questions. Understand the meaning of the WH words. Answer questions given in the text.\\n5 Read and enjoy a variety of reading-age-appropriate and high-interest books and texts from print and non-print sources: Labels (e.g., labels around the classroom such as labeled clock, black/whiteboard, desk, chair etc.) Picture based text (e.g., visual timetable)\\n6 Investigate how settings and characters are built up from details and identify keywords and phrases.\\n7 Use transitive and intransitive verbs in sentences ie she bought a pan, the dog barked.\\n8 Use present perfect for actions occurring at an unspecified time. e.g., already, just yet.\\n9 Understand and use adverbs of manner, time, place and frequency.\\n10 Write opinion pieces in which they introduce the topic or book they are writing about, state an opinion, supply reasons that support the opinion, use linking words (e.g., because, and, also) to connect opinion and reasons, and provide a concluding statement or section.\\n11 Write at least one paragraph with adverbs. (for eg., by words. Quickly, he grabbed his arm & pushed him away.)\\n12 Write multi-syllable words at grade level with correct spelling, adjectives, and adverbs (for e.g., I was dysad) to show a glimpse of characterisation.\\nobject: Diagram representing the step-by-step process under the 'Explorer's Pathway' with corresponding text descriptions for each step, presented in a circular design.",
    "page_type": null,
    "pdf_page_no": 92,
    "book_page_no": 88,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/92.jpeg"
  },
  {
    "text": "Memory Lane\n\nBefore we dive into Namira Salim's inspiring story, let's get to know some special words. These words will help us understand her journey better.\n\nNew words to know\nastronaut\nsomeone who travels into space\norbit\nthe path a space object takes around a planet or star\nspacecraft\na vehicle designed for space travel\ngalaxy\na large group of stars, gas, and dust bound together by gravity\ngravity\nforce that attracts objects towards each other, like how we are pulled towards the Earth\n\nNow that we know these amazing words, we're ready to explore Namira Salim's story. Remember, every word you learn is like a star in the sky of knowledge\n\nObject: Illustration of a cartoon figure resembling an astronaut waving hand, wearing a spacesuit with helmet, surrounded by celestial objects like stars, planets, a rocket, and clouds. Object: Illustration of a cartoon girl with dark hair using a telescope to look at stars and planets, surrounded by clouds and celestial icons.",
    "page_type": null,
    "pdf_page_no": 93,
    "book_page_no": 89,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/93.jpeg"
  },
  {
    "text": "\\nJourney through the text\n\nReaching for the Stars\nIn Taleemabad, a place full of dreams and adventures, Pinky looked up to Namira Salim, the first Pakistani astronaut, who had just returned from space.\nNamira, a hero to many, started teaching young children about space, including Pinky.\n\nWhen Namira Salim came back from space, she brought stories and lessons from the stars. In Taleemabad, everyone was excited, especially Pinky. Namira became a teacher, sharing her space adventures and teaching about the stars and planets.\n\nWhat did Namira Salim share with the people in Taleemabad?\nPinky joined Namira's classes. She wanted to learn everything about space. Namira taught them about the spacecraft and how every part has a special name. Pinky learned about the 'Oxygen Tank' which helps astronauts breathe, and the 'Main Engine Start' which sets the spacecraft flying.\n\nWhy did Pinky join Namira's classes?\nNamira showed them pictures and models of spacecraft. She explained that every label on them was very important. 'Knowing these labels can help us in space,' Namira said. Pinky listened carefully, remembering each word.\nObject: Illustration of a smiling astronaut with a waving hand, next to a cartoon-style diagram labeled 'Parts of a rocket' with arrows pointing to different parts of the drawn rocket.",
    "page_type": null,
    "pdf_page_no": 94,
    "book_page_no": 90,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/94.jpeg"
  },
  {
    "text": "Chapter 8\nReaching for the Stars\n\nWhy are the labels on a spacecraft important?\n\nNamira told them that being an astronaut was not just about flying to space. It was about learning and exploring. Pinky felt happy. She now knew that space was not just about stars and planets, but also about learning new things. It makes you realise how big the universe is.\nObject: Illustration of various celestial bodies and a spacecraft amidst stars.\n\nSpace exploration significantly expands our understanding of the universe. It allows scientists to study celestial phenomena, the laws of physics in extreme conditions, and the origins of the universe. This knowledge can provide insights into the history and future of our own planet.\n\nThe challenges of space exploration drive technological advancements that often have practical applications on Earth. Technologies developed for space missions have led to improvements in areas like telecommunications, medical imaging, and material science.\n\nObserving Earth from space also provides critical data on climate change, natural disasters, and environmental degradation. This information is essential for developing strategies to protect our planet.\n\nPinky realised how special Namira's journey was. It was not only about going to space but also about teaching others. Pinky dreamed of her own space adventures, inspired by Namira's stories.",
    "page_type": null,
    "pdf_page_no": 95,
    "book_page_no": 91,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/95.jpeg"
  },
  {
    "text": "\\nDiving deeper\\n\\nActivity: Discovering the Story's World\\nThink about the words that helped you picture Namira's journey in space. For example, did you read about her 'spacesuit'? What does that tell us about where she was?\\nWrite down three words that describe Namira's world in space. For instance, \"stars\", and \"spacesuit\".\\n1. ______________________________\\n2. ______________________________\\n3. ______________________________\\n\\nActivity 2: Creating WH-Questions\\nFind some words in our story about space and turn them into questions! For example, if you pick the word 'galaxy', you could ask, 'What is a galaxy?' or 'Where can our galaxy be found?'\\n1. Who: ______________________________\\n2. What: ______________________________\\n3. When: ______________________________\\n4. Where: ______________________________\\n5. Why: ______________________________\\n\\nActivity 3: Fun with Verbs\\nLet's play with verbs - the action words!\\nSome verbs, called transitive, need an object after them to make sense, like 'Namira adjusted her helmet.' Here 'adjusted' is a transitive verb because it acts on 'helmet.'\\nObject: Illustration of a smiling emoji with a thinking pose under \"Discovering the Story's World\" section and another smiling emoji under \"Fun with Verbs\" section.",
    "page_type": null,
    "pdf_page_no": 96,
    "book_page_no": 92,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/96.jpeg"
  },
  {
    "text": "But some verbs, called intransitive, don't need an object. For example, in 'Namira smiled,' 'smiled' is an intransitive verb because it doesn't act on anything.\n\nObject: Table comparing \"Transitive Verbs\" which need an object, with examples, and \"Intransitive Verbs\" which cannot have an object, with examples.\n\n1. Read the following sentences and write whether they have transitive or intransitive verbs. Underline the verb and the circle the object.\na. Pinky looked up to Namira Salim.\nb. Everyone was excited.\nc. Pinky felt happy.\nd. Namira brought stories and lessons.\n\n2. Find five transitive and five intransitive verbs in our story about Namira. Write them in two lists. See how the action words fit into the sentences!\n\nObject: Empty table for listing \"Transitive Verbs\" and \"Intransitive Verbs\" based on a prior assignment.",
    "page_type": null,
    "pdf_page_no": 97,
    "book_page_no": 93,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/97.jpeg"
  },
  {
    "text": "Chapter 8\nReaching for the Stars\n\nShare and Sparkle\n\nActivity 1: Group Discussion\n\nHello space friends! Let's talk about what we have learnt, listen to each other, and share our ideas. Are you ready to be star communicators? Let's discuss Namira Salim's journey! What inspired you the most? Choose your favourite part of Namira's story and tell the class why you liked it. Remember to listen to your friends carefully and think about what they say.\n\nHere are some sentences to help you in your discussion:\n\nStart with: One thing that inspired me the most about Namira's story was ___.\n\nRespond to your group member's idea by starting with: I like how you were inspired by ______ because _______.\n\nActivity 2: Empathy and Respect Debate\n\nTime for our space debate! Let's think about this:\n\n'Is space exploration important?' Is it right to spend money on space exploration when there are so many people in the world who don't have enough food?\nRemember, there's no right or wrong answer. Just share what you think and listen to your friends. Let's respect everyone's ideas!\n\nSimple Debate Structure:\n\nThink About Your Opinion:\nDecide if you think space exploration is important or not.\nWhy do you feel that way?",
    "page_type": null,
    "pdf_page_no": 98,
    "book_page_no": 94,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/98.jpeg"
  },
  {
    "text": "Chapter 8\nReaching for the Stars\n\nExpress Your Opinion:\nWhen it's your turn, start by saying, \"I think space exploration is important/not important because...\"\n\nGive Your Reasons:\nExplain why you have that opinion. Try to give at least one or two reasons. For example, \"I think it's important because it helps us learn about space and find new things.\"\n\nConclude Simply:\nFinish by summarising your main point, like \"So, that's why I think space exploration is really important/not important.\"\n\nGrammar Playground\n\nWe are going to have fun with grammar tricks! We will play with the present perfect tense and make questions using 'be' form verbs.\n\nActivity 1: Present Perfect Practice\n\nThe present perfect tense is used for actions that happened at an unspecified time before now. We use have or has with the past participle\nof the verb. For example, 'Namira has travelled to space.' We know\nshe travelled sometime in the past but not exactly when.\nObject: Emoji depicted as a smiling character wearing glasses. Object: Emoji depicted with a thoughtful expression, character wearing a purple top.",
    "page_type": null,
    "pdf_page_no": 99,
    "book_page_no": 95,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/99.jpeg"
  },
  {
    "text": "Reaching for the Stars\n\nYou CANNOT use words like yesterday, one year ago or last week. Let's practise!\n\nWrite three sentences about things you or someone else 'have' or 'has' done. Use words like 'already', 'just', and 'yet'.\n\nExample, \"I have just learned about galaxies.\"\n\nActivity 2: Making Questions with 'be' Form Verbs\n\nQuestions with 'be' form verbs are super important. They help us ask about things and plans. Remember, the 'be' verbs are 'am', 'is', and 'are'. For example, 'Are you going to the Science Fair?' Let's try making some questions.\n\nWrite three questions using 'be' form verbs. Think about things you might ask your friends or family.\n\nExample, \"Is your favourite planet Mars?\"\n\nActivity 3: Let's create sentences using adverbs!\n\nAdverbs are a type of word that modifies or describes a verb, an adjective, or another adverb. They often provide information on how, when, where, or to what extent an action is performed.\n\nAdverbs can help to answer questions such as 'how?', 'when?', 'where?', 'to what extent?', or 'why?'. For example, in the sentence 'She ran quickly.', the adverb 'quickly' modifies the verb 'ran' by describing how she ran.\n\nThere are four types of adverbs.",
    "page_type": null,
    "pdf_page_no": 100,
    "book_page_no": 96,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/100.jpeg"
  },
  {
    "text": "Chapter 8\nReaching for the Stars\n\nType    Definition    Adverbs    Examples Of Use\nTime    when action happens    Already, ago, before, lately, recently, soon, yet, yesterday, tomorrow ..    .Has the candidate arrived already?\nI'm expecting a phone call soon.\nThe taxi hasn't arrived yet.\nLet's talk about that tomorrow.\n\nPlace    where action happens    Here, there, above, away, below, behind, downstairs, near, outside -    .Your jacket is here on the chair.\nMy sister lives near the school.\nThe garden is behind the house.\nI got dressed and went downstairs.\n\nFrequency    how many times the action happens    Always, sometimes, rarely, occasionally, seldom, usually, never -    .We occasionally go to the theatre.\nI usually walk to work.\nWe sometimes go out for a meal.\nI'm a vegetarian. I never eat meat.\n\nManner    how an action happens    Badly, accidentally, fast, well, carefully, easily, quickly, quietly, slowly -    .She bandaged her finger carefully.\nThe problem was easily solved.\nHe ran quickly to catch the bus.\nThe child reacted badly.\n\n1. Write a sentence about an astronaut using an adverb of manner.\n_Example: \"The astronaut floated gracefully in the spacecraft.\"\n\n2. Create a sentence about a spacecraft using an adverb of time.\n_Example: \"The spacecraft will launch soon.\"\n\n3. Describe a galaxy using an adverb of place.\n_Example: \"There are billions of stars everywhere in our galaxy.\"",
    "page_type": null,
    "pdf_page_no": 101,
    "book_page_no": 97,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/101.jpeg"
  },
  {
    "text": "4. Make a sentence about gravity using an adverb of frequency\n\nExample, \"Gravity always keeps us grounded on Earth.\"\n\nObject: Illustration of a cartoon character wearing a spacesuit and holding a flag.\n\nImagination Canvas\nI will be your guide to an amazing space adventure in words! First, let's have some fun with words that have different sounds, words that describe a person, place or thing, and words that describe our actions. Once we get to know them, we will use them to write a space story. Are you ready? Let's blast off!\n\nActivity: Getting to Know Our Words\n\nLet's go on a word discovery journey, and learn about multi-syllable words, adjectives, and adverbs!\n\nMulti-Syllable Words:\nA syllable is like a beat in a word. For example, in 'rocket,' we have two beats: rock-et. That's two syllables! Multi-syllable words are just words with more than one beat. They can make your story sound interesting and fun.\n\nAdjectives:\nAdjectives are special words that describe nouns. Oh, and a noun is the name of a person, place, thing, or idea. So, if we have a noun like 'star,' an adjective can describe it, like 'bright star.' Adjectives help make our story colourful and exciting!\n\nAdverbs:\nAdverbs are cool words that sometimes end in 'ly' and they describe how something is done. They add spice to our verbs, which are action words. For example, 'quietly floated' or 'quickly jumped.' Adverbs make our actions in the story more interesting!",
    "page_type": null,
    "pdf_page_no": 102,
    "book_page_no": 98,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/102.jpeg"
  },
  {
    "text": "Chapter 8\nReaching for the Stars\n\nStep 1: Word Discovery\n\nNow, let's be word detectives! Find and write down five multi-syllable words, five adjectives, and five verbs that you think are perfect for a space adventure. Remember, multi-syllable words have more than one beat, adjectives describe nouns, and adverbs tell us how something is done.\n\nStep 2: Writing Your Space Adventure Paragraph\n\nWell done on making your list of words! Now, let's use them to write a short story about space. Imagine a character on an exciting space mission. What happens to them? Maybe they're exploring a new planet or traveling through a galaxy. Use at least three multi-syllable words, three adjectives, and three adverbs from your list to make your story come to life.\n\nTips for Your Writing:\n\n- Think of a setting like a spacecraft or an alien planet.\n- Create a character - what are they like? Brave, curious, careful?\n- Describe an action or event in your story. Use words that give us a clear picture.\n- Have fun with it! Your imagination is the limit.\n\nConnect and Create\n\nHey there future writers! Now that we've explored Namira Salim's space story, let's write our own opinion pieces. You'll choose a topic, share your thoughts, and explain why you feel that way. Ready to share your views with the world? Let's get started!\nObject: Illustration of a child in a spacesuit looking at stars with a magnifying glass.",
    "page_type": null,
    "pdf_page_no": 103,
    "book_page_no": 99,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/103.jpeg"
  },
  {
    "text": "Chapter 8\nReaching for the Stars\n\nChoose Your Topic\n\"First, pick a topic related to our space journey. It could be about space travel, being an astronaut, or even about exploring new planets. What part of our space story fascinated you the most?\"\n\nState Your Opinion\n\"Now, it's time to state your opinion. Do you think space exploration is important? Are you fascinated by life on other planets? Share what you think.\"\n\nWrite Your Opinion Piece\n\n- Introduction:\nStart by introducing your topic. For example, \"I believe space explora-tion is crucial for our future.\"\n\n- State Your Opinion:\nClearly say what you think about the topic.\n\n- Supporting Reasons:\nGive reasons why you feel this way. Use words like 'because', 'and', 'also' to connect your ideas. For example, \"Space exploration is important because it helps us understand our universe. It also inspires new technologies and can even teach us about life on Earth.\"\n\n- Concluding Statement:\nEnd with a strong conclusion that wraps up your thoughts. For example, \"Therefore, exploring space is not just about reaching the stars; it's about expanding our knowledge and inspiring future generations.\"\n\n- Background Information and Vocabulary:\nRemember to use the information and vocabulary we learned about space. This will make your opinion piece richer and more interesting.",
    "page_type": null,
    "pdf_page_no": 104,
    "book_page_no": 100,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/104.jpeg"
  },
  {
    "text": "9\nThe Dancing Poem\n\nExplorer's Pathway\n\nObject: A graphic representation of a pathway with various points marked with numbers from 1 to 13, each corresponding to a different learning activity.\nRecall and discuss important features of a talk, possibly contributing new ideas within a familiar and an unfamiliar group setting.\nAsk questions to obtain information and explain ideas clearly, making the meaning explicit.\nUnderstand the use of more modal verbs eg. can, could, may, might, must, ought, shall, should, will, and would.\nRead a range of stories, poetry and information books and begin to make links between them.\nGuess the meaning of new words as given in the text.\nHighlight/underline keywords and phrases to identify the main points in a passage.\nIdentify rhyme and rhythm, repetition, similes, and sensory images in poems.\nUse infinitive in sentences i.e. Teacher helped the students to complete the class project.\nIdentify, understand and use adverbs that qualify verbs, adjectives and other adverbs.\nIdentify the use of the apostrophe for indicating possession (e.g., the player's ball, Paul's toy/ Paul's toy, the cook's pies, the children's toys, a week's holiday) and in contractions (e.g., it's raining).\nUse simple present verbs to show habitual actions, universal statements, and current facts in sentences and paragraphs.\nParaphrase the text in your own words.\nWrite a simple cinquain (poem).\n\nObject: An illustration of a treasure chest filled with stars.",
    "page_type": null,
    "pdf_page_no": 105,
    "book_page_no": 101,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/105.jpeg"
  },
  {
    "text": "Memory Lane\n\nBefore we twirl through our poem, let's first look at the title and the picture. What words do you think you will read about in a poem on dances?\n\nNew words to know\nsway\nto move slowly\nfrom side to\nside\ntwirl\nto spin around\nquickly\ntapestry\nsomething made\nof many\ndifferent parts,\nall woven\ntogether\ncrescendo\na sound that\ngets louder\nand louder\n\nActivity: Dance Moves\n\nCan you show what these words mean with your own dance moves?\n\n1. Show me how you would 'sway' like the fields of Punjab.\n2. Can you 'twirl' like the dancers in Sindh's Ho Jamalo?\n3. Create a group pose that looks like a 'tapestry' of different dance moves.\n4. Start clapping softly, then get louder and louder, like a 'crescendo' in music.\n\nObject: Illustration of three children, two girls and a boy, demonstrating dance moves on top of desks.",
    "page_type": null,
    "pdf_page_no": 106,
    "book_page_no": 102,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/106.jpeg"
  },
  {
    "text": "Journey through the text\n\nThe Dancing Poem\n\nIn Punjab, where fields of green sway,\nThe dhol's beat calls for bhangra, come what may.\nDancers leap, their joy on full display.\n\nObject: Illustration of a boy and a girl dancing, with the boy shouting \"HO JAMALO!\"\n\nCan you hear the rhyme in these lines? What words make the end of the lines sound similar?\n\nSindh's rhythm declares, \"Ho Jamalo\" in the air,\nFeet tap and twirl without a single care,\nA tapestry of motion, light and fair.\n\nIn Balochistan, the Lewa beats start slow,\nThen crescendo in the desert's glow,\nA dance of strength, as winds blow.\n\nThe hills of Khyber Pakhtunkhwa share a tale,\nWhere Attan dancers in a circle sail,\nTheir spins and claps like a woven veil.\n\nGilgit's swords clash with a metallic song,\nCowboys dance, their steps sure and strong,\nIn Payaloo's dance, they all belong.\n\nObject: Illustration of a girl dancing vigorously.\n\nWhat simile is used to describe the Attan dancers? How does it help you picture their dance?\n\nWhat do you imagine when you hear 'swords clash' in the poem?",
    "page_type": null,
    "pdf_page_no": 107,
    "book_page_no": 103,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/107.jpeg"
  },
  {
    "text": "\\nDiving deeper\nWe've danced with words, now let's think deeper. What did our poem really mean? Let's find out together!\n\nPinky's Poem Puzzlers\n1. Which dance is matched with the sound of the 'dhol' in our poem?\n2. What phrase is used to describe the movement in Sindh's dance?\n3. How is the pace of the Lewa in Balochistan first described?\n4. What does the circular movement of the Attan represent?\n5. Name the two dances mentioned for Gilgit Baltistan.\n6. After reading about these dances, what feelings or images do they bring to your mind? Write down two things you imagine when you think of these dances.\nObject: Illustration of a group of diverse children dancing joyfully.\n\nShare and Sparkle\nGroup Activity: Pinky's Cultural Exchange\nLet's chat about our poem and the beautiful dances of our country.\n- Sit in a circle with your classmates.",
    "page_type": null,
    "pdf_page_no": 108,
    "book_page_no": 104,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/108.jpeg"
  },
  {
    "text": "\\nGroup Activity: Pinky's Cultural Exchange\n- One by one, share what dance from the poem you liked best and why.\n- Think of questions you have about the dances or the poem and ask the group.\n- If someone says something you like or agree with, give a thumbs up and explain why. Offer your own ideas about what the poem tells us about Pakistan's culture.\nExample Questions to Start:\n- What dance in the poem would you like to learn?\n- How do you think these dances show Pakistan's culture?\n- Can anyone think of a dance from your own family or village?\nObject: Illustration of four children sitting and discussing, with a speech bubble containing a thumbs-up icon and various dance representations.\n\nGrammar Playground\nWelcome to the Grammar Galal Let's jump into the fun world of words and learn how to make our sentences shine!\n\nActivity 1: Infinitive Fun\nAn infinitive is when we use 'to' with a verb, like 'to dance' or 'to sing'. We use it to tell why we do something.",
    "page_type": null,
    "pdf_page_no": 109,
    "book_page_no": 105,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/109.jpeg"
  },
  {
    "text": "\\nExample, She practises every day to win the dance competition\\n\\nComplete the sentences below.\\n1. I love ____________ (play) hide and seek after school.\\n2. Our teacher wants us ____________ (learn) our multiplication tables.\\n3. Pinky hopes ____________ (visit) the zoo on her birthday.\\n4. It's important ____________ (listen) when someone is speaking.\\n5. Can you try ____________ (draw) a picture of your house?\\n\\n\\nActivity 2: Adverb Adventure\\nAdverbs are words that describe how, when, where, or how much we do something, like 'quickly', 'yesterday', 'outside', or 'very'.\\n\\nExample, She spoke very quietly in the library.\\n\\nFill in the blanks below.\\n1. The dancers moved very ____________ (quick/quickly).\\n2. Jojo always does his homework ____________ (careful/carefully).\\n3. Pinky ____________ (happy/happily) shared her toys.\\n4. They can run ____________ (fast/fastly) in the race.\\nObject: Three circle diagrams each divided into equal sections, colored differently, with a cartoon character of a girl wearing a yellow hat and purple clothing, standing to the left of the diagrams.",
    "page_type": null,
    "pdf_page_no": 110,
    "book_page_no": 106,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/110.jpeg"
  },
  {
    "text": "\\nActivity 3: Apostrophe Alley\nWe use an apostrophe for two reasons: to show that something belongs to someone, and in contractions to show that letters are missing.\n\\nExample,\nThis is Jojo's ball.\nCorrect the sentences using an apostrophe.\n1. This is Pinky favourite book.\n____________________\n2. The cat whiskers are very long.\n____________________\n3. Is not it the same as saying 'it is'?\n____________________\n4. The children playground is over there.\n____________________\n5. I cannot find my socks.\n____________________\n\\nActivity 4: Present Simple Party\nWe use the present simple tense for things we do often or for facts that are always true.\nChoose the correct option to complete the sentences.\nThe Earth revolves around the Sun.\n\\nObject: Illustration of a figure standing next to a school chalkboard with a chalk diagram of an questioned statement.",
    "page_type": null,
    "pdf_page_no": 111,
    "book_page_no": 107,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/111.jpeg"
  },
  {
    "text": "1. Pinky _____________ (jump/jumps) rope every morning.\n2. The sun _____________ (rise/rises) in the east.\n3. Birds _____________ (fly/flies) in the sky.\n4. We _____________ (learn/learns) new words in school every day.\n5. Jojo _____________ (like/likes) to eat pizza on Fridays.\n\nObject: Illustration of a girl with colored waving ribbons.\n\nImagination Canvas\n\nPoems are like paintings with words. Let's create a cinquain together and then highlight our poem's most important bits!\n\nCinquain Creation\n\nA cinquain has five lines.\nThe first line has one word (a title).\nThe second line has two words (describing the title).\nThe third line has three words (showing action).\nThe fourth line has four words (expressing feelings or a complete sentence).\nAnd the fifth line has one word (another word for the title or a word that sums it up).",
    "page_type": null,
    "pdf_page_no": 112,
    "book_page_no": 108,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/112.jpeg"
  },
  {
    "text": "Example\nDance\nColourful, lively\nTwirling, leaping, spinning\nJoy in every movement\nCelebration\n\nSample Passage: The Rhythm of Pakistan\nIn the heart of Pakistan, dances flourish like spring blooms. From the vigorous Bhangra of Punjab, the graceful Lewa of Balochistan, to the intricate steps of Sindh's Dhammal, each dance is a heartbeat of its province. They carry the stories and rhythms passed down through generations. These dances are more than tradition; they are the living soul of Pakistan's cultural tapestry.\n\nHighlighting Activity\nNow, take your marker and underline the important parts in our dance passage. What words or phrases tell you about the dances and why they're special?\n\nExample\n\"Dances flourish like spring blooms.\"\nObject: Illustration of a person holding a marker pointing to a text bubble saying \"Dances flourish like spring blooms.\" surrounded by colorful drawings of dancing figures with labels such as \"HO JAMAL!\"",
    "page_type": null,
    "pdf_page_no": 113,
    "book_page_no": 109,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/113.jpeg"
  },
  {
    "text": "\\nConnect and Create\\nTime for a treasure hunt in the world of stories and poems! At home, can you find the hidden threads that tie them all together?\\n\\nHome Task: Story and Poem Weavers\\nChoose a story, a poem, and an information book from your school library or home.\\n\\nRead: Enjoy each one and think about what they share. Is it a common theme, like bravery, or maybe a shared setting, like the mountains of Pakistan?\\n\\nLink:\\nWrite down one thing that connects all three. It could be a feeling, a message, or something else.\\n\\nCinquain:\\nNow, write a cinquain poem about that connecting idea. Use what you've read to inspire each line.\\n\\nShare:\\nBring your poem to class and tell us how each book gave you the idea for your poem.\\nObject: A cartoon of a girl sitting on a floor cushion, leaning on a stack of books, holding a cup, with a bookshelf and a picture frame with a bridge on the wall behind her.",
    "page_type": null,
    "pdf_page_no": 114,
    "book_page_no": 110,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/114.jpeg"
  },
  {
    "text": "10\nBridge Builder Unite\n\nExplorer's Pathway\n\nEnact a short drama\\/playscript showing different roles and scenarios through deliberate choice of dialogues\\/speech, gestures, and movements.\n\nSpeak confidently using varied vocabulary and tone to express, persuade, instruct, or offer advice to engage the listener. (e.g., talking about reports, articles, programmes, etc.)\n\nTake turns to speak on a range of topics of their own choices.\n\nHighlight the main idea\\/theme of the text with reference to any illustrations given in the text.\n\nRetell or paraphrase events from the text in response to questions.\n\nRead and follow instructions correctly to assemble\\/operate a product.\n\nDevelop understanding to expand adverbs into adverb phrases.\n\nUse a comma and quotation marks in direct speech.\n\nUse past simple for completed actions\\/events and regular actions in the past. (In paragraphs)\n\nUse a variety of transitional words and phrases to manage the sequence of events, such as 'Earlier...' or 'Nearby...' or 'Firstly,', 'Secondly...'. They can also use phrases in the same way: 'Later on...' or 'Far away...'\n\nWrite short texts in speech bubbles and cartoon strips using vocabulary, tone, style of expression appropriate to the communicative purpose and context.\nObject: Illustration of a treasure chest filled with gold coins.",
    "page_type": null,
    "pdf_page_no": 115,
    "book_page_no": 111,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/115.jpeg"
  },
  {
    "text": "Memory Lane\n\nBefore you go on an adventure of building a bridge with Pinky, let's learn some new words that will help you understand the story better.\n\nNew words to know\n\nsturdy\nstrong and firm; not easily broken or damaged\n\nfestive\nhaving a cheerful and lively atmosphere, especially in celebration\n\nrhythm\na regular repeated pattern of sounds or movements\n\nurgent\nrequiring immediate attention or action\n\nmanual\na book or booklet that gives instructions or information about how to do something\n\nassemble\nto put together pieces or parts to form something\n\nObject: Illustration of a compass-like character with a speech bubble saying \"Before you go on an adventure of building a bridge with Pinky, let's learn some new words that will help you understand the story better.\"\n\nLook at the pictures in the story! Can you guess the main idea of the story by just looking at them?\n\nObject: Illustration of a light bulb character with a speech bubble asking \"Look at the pictures in the story! Can you guess the main idea of the story by just looking at them?\"\n\nJourney through the text\n\nIn Taleemabad, a sunny morning brought an unexpected adventure. The old wooden bridge, which connected two parts of the town, had become too fragile to cross. This was a big problem because today was Jojo's birthday, and he was on the other side of the river, feeling lonely and cut off from his family and friends.\n\nObject: Illustration of a young boy on a wooden bridge over a river, with fish in the water and grass alongside the river banks.",
    "page_type": null,
    "pdf_page_no": 116,
    "book_page_no": 112,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/116.jpeg"
  },
  {
    "text": "\"We must build a new bridge to bring Jojo back for his birthday party!\" declared Pinky, her voice filled with determination. Sir Riaz, who had gathered with the concerned community, nodded in agreement. \"Let's make it a special birthday bridge for Jojo,\" he suggested.\n\nSir Riaz brought out an instruction manual titled 'Fun Bridge Building for Everyone!' \"First, we gather the materials. Then, we design a strong yet fun bridge. And finally, we build it together, like a big family,\" he read aloud from the manual.\n\nObject: Illustration of an instruction manual page showing three depicted steps labeled '1, 2, 3' with various actions related to bridge building, such as collecting materials and designing the bridge.\n\nObject: Illustration of a question in a speech bubble asking, \"What are the three main steps mentioned in the instruction manual for building the bridge?\"\n\nPinky jumped into action. \"I'll collect the most colourful stones and the sturdiest wood!\" she exclaimed. The manual showed them how to test the wood for strength by tapping it and listening for a solid sound, and how to choose stones that were just the right size for a safe and stable bridge.\n\nAs the community worked, the atmosphere was festive and energetic. Everyone sang and chanted in rhythm, turning the work into a playful scene. \"Lift and place, tap and test, paint and decorate!\" they sang along.\n\nAcross the river, Jojo watched in awe as the bridge took shape. He could see colourful banners and hear cheerful voices. \"They are building it for me!\" he thought, feeling a rush of happiness and love.",
    "page_type": null,
    "pdf_page_no": 117,
    "book_page_no": 113,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/117.jpeg"
  },
  {
    "text": "How do you think Jojo felt when he saw the new bridge and why?\\n\\nThe bridge was completed just as the sun began to set, casting a golden glow over Taleemabad. It was sturdy, safe, and beautifully decorated with colours and patterns. Everyone shouted, \"Happy Birthday, Jojo!\" as he crossed the new bridge, greeted by hugs and smiles.\\n\\n\"This isn't just a bridge; it's a birthday present from all of us,\" said Sir Riaz, as Pinky and Jojo stood together on their new bridge. \"It shows what we can do when we come together for someone we care about.\"\\n\\nWhat does Sir Riaz mean when he says the bridge is more than just wood and stones?\\n\\nJojo's birthday turned into a celebration for the whole community, with the new bridge symbolising their unity, teamwork, and the love they shared.\\n\\n\\nDiving deeper\\n\\nActivity 1: Discovering the Main Idea with Pinky\\n\\nLet's think about what our bridge-building adventure really means! Circle the statement that you think is the heart of our story.\\n\\n1. Building a bridge is hard work and requires lots of materials.\\n2. Working together brings us closer and helps us do amazing things!\\n3. Birthday parties by the river are the best.",
    "page_type": null,
    "pdf_page_no": 118,
    "book_page_no": 114,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/118.jpeg"
  },
  {
    "text": "Activity 2: Sequence the Story with Pinky\n\nCan you remember how our story unfolded? Put these events in the order they happened. It's like building our bridge, piece by piece!\n\nRead each event and number them from 1 to 6 in the order they happened in our story.\nBridge Construction: Everyone works together, following the manual's instructions to build the new bridge.\n\nCelebration Time: The bridge is finally made and we celebrate Jojo's birthday.\n\nJojo's Lonely Morning: Jojo feels all alone on the other side of the river.\n\nGathering Materials: We all gather materials for our special bridge.\n\nPinky's Call to Action: Pinky sees Jojo and decides to help build a new bridge so he can come back.\n\nSir Riaz's Plan: Sir Riaz shows us the manual for bridge building.\n\nActivity 3: Retell and Respond with Pinky\n\nNow, let's dive deeper! Answer these questions in your own words, just like you're telling a friend about our adventure.\n1. Why was building the bridge so important for all of us in Taleemabad?\n2. What did we do to make creating the bridge a super fun experience?\n3. What does our new, awesome bridge stand for in Taleemabad?\n\nActivity 4: Let's build a bridge!\n\nMaterials: popsicle sticks glue tape",
    "page_type": null,
    "pdf_page_no": 119,
    "book_page_no": 115,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/119.jpeg"
  },
  {
    "text": "Chapter 10\nBridge Builder Unite\nSteps:\n1. Lay two popsicle sticks parallel on the table.\n2. Attach a popsicle stick vertically at each end to form an \"H\" shape.\n3. Connect two more popsicle sticks diagonally between the vertical sticks.\n4. Repeat steps 1-3 to create two identical \"H\" shapes.\n5. Attach the two \"H\" shapes together to form a bridge structure.\n6. Reinforce with additional popsicle sticks for strength.\n7. Use glue and tape to secure joints.\n8. Let it dry.\n9. Test your bridge by placing small objects on top to see how much weight it can hold.\nHave fun building your strong and creative bridges!\n\nGrammar Playground\nTransforming Adverbs into Adverb Phrases\nAdverbs add more detail to verbs and can be turned into adverb phrases to make sentences more interesting. Let's practise this!\nBelow are some adverbs and a list of phrases. Your task is to match each adverb with a phrase from the list to create an adverb phrase. Then, use your adverb phrase in a sentence!\nAdverbs:\nCheerfully\nCarefully\nEagerly\nLoudly\nPhrases:\nwith great excitement\nin a gentle manner\nwith a big smile\nin a high voice",
    "page_type": null,
    "pdf_page_no": 120,
    "book_page_no": 116,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/120.jpeg"
  },
  {
    "text": "\\nCreate Your Adverb Phrases and Sentences\nAdverb: _______ + Phrase: __________\n= Adverb Phrase: ______________________________\nSentence: ____________________________________________\n\nAdverb: _______ + Phrase: __________\n= Adverb Phrase: ______________________________\nSentence: ____________________________________________\n\nAdverb: _______ + Phrase: __________\n= Adverb Phrase: ______________________________\nSentence: ____________________________________________\n\nAdverb: _______ + Phrase: __________\n= Adverb Phrase: ______________________________\nSentence: ____________________________________________\n\n\\nActivity 1: Past Adventure Paragraphs\n\\nPast Simple (Past Tense):\nThe past simple tense is used to describe completed actions or events that occurred at a specific point in the past. It is formed by adding \"-ed\" to regular verbs, and irregular verbs have unique past tense forms. For example, \"I played cricket yesterday\" or \"She ate breakfast at 7 AM.\"\n\n\\nTime Travel:\nThink about a day from your past where you worked as a team.\n\n\\nPast Simple:\nWrite a paragraph using past simple (like \"played\" or \"helped\") to describe a completed event or action from that day.",
    "page_type": null,
    "pdf_page_no": 121,
    "book_page_no": 117,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/121.jpeg"
  },
  {
    "text": "\\nRegular Action:\\nWrite another paragraph in past simple about a routine activity you often did, like \"walked my dog\" or \"ate cookies\".\\n\\nShare:\\nShare your paragraphs with classmates and enjoy discovering each other's past adventures!\\n\\nShare and Sparkle\\n\\nActivity 1: Let's Pretend and Tell a Story\\nTransitional words and phrases are like magical bridges in writing. They help connect ideas smoothly, making your sentences flow nicely. Use words like \"first,\" \"next,\" and \"finally\" to guide your readers through your amazing stories!\\nObject: Illustration of three children planning to build a bridge, with one child speaking (thought bubble indicates speech), symbolizing teamwork and storytelling.\\nLet's pretend to be part of the bridge-building team and then turn our adventure into an exciting story!\\n\\nPair up with a friend. One of you is the builder, the other is the planner.\\n\\nUse words like 'first,' 'then,' and 'finally' to plan how you'll build the bridge.\\n\\nDiscuss your plan together, like \"First, we'd gather materials, then design the bridge, and finally, build it!\"\\n\\nNow, turn your planning session into a story. Start with \"One sunny day in Taleemabad...\"",
    "page_type": null,
    "pdf_page_no": 122,
    "book_page_no": 118,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/122.jpeg"
  },
  {
    "text": "Activity 1: Let's Pretend and Tell a Story\nUse adverbs like 'excitedly,' 'nervously,' or 'happily' to describe actions and feelings.\nChange your voice for different characters to make the story come alive.\n\nActivity 2: Group Chat on Teamwork\nNow that we've built bridges and told stories, let's chat about teamwork. How did working together help in our story?\n- Gather in a group and share your thoughts about teamwork.\n- Use 'I think' or 'I feel' to express your ideas.\n- Ask questions like \"What do you think teamwork is?\" or \"How does teamwork help in big projects?\"\n- Listen carefully to your friends, nodding or smiling to show you understand, and share your ideas too.\n\nObject: Illustration of a light bulb with a smile and dialog bubble.\n\nImagination Canvas\nLet's learn about comic strip!\nA comic strip is like a mini-story with pictures and speech bubbles. It's a fun way to tell a tale using both words and drawings. Imagine your favorite characters having exciting adventures in a small, colorful picture story!",
    "page_type": null,
    "pdf_page_no": 123,
    "book_page_no": 119,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/123.jpeg"
  },
  {
    "text": "Activity 1: Story Planning\n\nObject: Three graphics, showing two children, one wearing glasses, discussing a blank comic strip with a speech bubble.\n\nBefore we draw, let's plan our comic strip story. Think about a fun adventure in Taleemabad.\n\n* Title of Your Comic Strip: ________________________________________________\n\nPlan Your Story\n\nFirst (Beginning):\n* What happens at the start of your story?\n* Which characters are in this part?\n* Write your ideas here:\n\n____________________________________________________________________________________\n\n____________________________________________________________________________________",
    "page_type": null,
    "pdf_page_no": 124,
    "book_page_no": 120,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/124.jpeg"
  },
  {
    "text": "Next (Middle):\n- What happens in the middle of your story?\n- How do the characters react or what do they do?\n- Write your ideas here:\n\nAfter That:\n- What happens next in your story?\n- Are there any new characters or new events?\n- Write your ideas here:\n\nFinally (End):\n- How does your story end?\n- What happens to the characters?\n- Write your ideas here:\n\nCharacters\n- List the main characters in your story:\n- Write one thing about each character (like what they like, how they feel, etc.):",
    "page_type": null,
    "pdf_page_no": 125,
    "book_page_no": 121,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/125.jpeg"
  },
  {
    "text": "\\nActivity 2: Draw Your Comic Strip\\nObject: Icon of a speech bubble with a drawing pencil inside it.\\nNow it's time to bring our story to life with drawings!\\n- Use the comic strip panels provided in the textbook.\\n- Draw your story in the panels, following the plan you made.\\n- Make sure your drawings show the action and the characters clearly.\\n\\nActivity 3: Writing Dialogues\\nObject: Icon of a speech bubble with speech lines inside it.\\nLet's add words to our story. What are your characters saying to each other?\\n- Write dialogues in speech bubbles for each panel.\\n- Use words that make the characters' conversations sound real and lively.\\n- Check that your dialogues match the story and show what the characters are feeling.\\n- Use comma and quotation marks in direct speech. For example: Pinky said, \"Let's make a bridge.\"\\n\\nConnect and Create\\nObject: Icon of two people with a globe in the background.\\nGet ready for an amazing journey into the world of theatre with us! Let's work together to create a play that's full of fun and surprises!\\n\\nForm Your Theater Group:\\nGather your friends and form a superstar team! Who's ready for an adventure?",
    "page_type": null,
    "pdf_page_no": 126,
    "book_page_no": 122,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/126.jpeg"
  },
  {
    "text": "Chapter 10\nBridge Builder Unite\nChoose a Taleemabad story that you all love. This will be the heart of your play!\n\nPlan Your Play:\n- Let's make each character shine! Make sure everyone has at least three things to say.\n- Structure your play in three acts: First, set the scene and introduce your characters. Next, dive into your exciting adventure. And finally, wrap it up with a grand finale that leaves everyone smiling!\n\nWrite Your Script:\n- It's time to write our dialogues! Think about how your characters feel and what they want to say. Make it snappy, make it fun!\n- Don't forget to add actions and movements. Let's see your characters come to life!\n- Script Example:\n    Title: The Taleemabad Picnic\n    Characters: Pinky, Sir Riaz, and Jojo\n    Sample Dialogue:\nObject: Emoji of a pink haired girl saying \"What a sunny day for a picnic!\"\nObject: Emoji of an older man with glasses saying \"Excellent idea! Let's all contribute something special.\"\nObject: Emoji of a young man looking slightly unsure saying \"I'll try making sandwiches, but I'm a bit nervous...\"\n\nRehearse and Perform:\n- Practice makes perfect! Help each other, speak up, and move with confidence.\n- Now, take the stage and show us the magic of your teamwork! Remember, every play is a masterpiece when you all work together!",
    "page_type": null,
    "pdf_page_no": 127,
    "book_page_no": 123,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/127.jpeg"
  },
  {
    "text": "Object: Illustration of three children looking at a large yellow poster titled 'The Taleemabad Picnic.' The children are depicted as colored cartoon characters, with one child reaching out to write something on the poster while the others look on. Around them are speech bubbles, all empty.",
    "page_type": null,
    "pdf_page_no": 128,
    "book_page_no": 124,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/128.jpeg"
  },
  {
    "text": "11\nChatter Patterns\n\nExplorer's Pathway\n\n1 Ask questions to obtain information and explain ideas clearly, making the meaning explicit.\n\n2 Differentiate between rhetorical patterns while listening (e.g., stress and intonation in an imperative statement: \"You must clean your room\", as opposed to a question: \"Will you clean your room?\").\n\n3 Retell or paraphrase events from the text in response to questions using pre and while reading strategies.\n\n4 Provide an accurate textual reference from more than one point in a story to support answers to questions.\n\n5 Identify character traits and setting to predict the proceedings in the text.\n\n6 Explain the meaning of simple similes and metaphors (e.g., as pretty as a picture) in context.\n\n7 Demonstrate use of prepositions in writing showing position, time, movement and direction.\n\n8 Recognise the function of joining words in sentences.\n\n9 Use simple connectors i.e. for addition (e.g., and, as well as) for reason (e.g., because) for sequence (e.g., first, second).\n\n10 Use past continuous for the actions that were in progress at some time in the past (e.g. Everyone was driving slowly because the roads were slippery).\n\n11 Write an informal letter to family and friends on personal, familiar topics and replies to a short informal letter from friends and family member for e.g., apology letter to a friend ('include sender's address, date, greeting, introduction, body, conclusion, signature')\nObject: Illustration of a treasure chest at the bottom right corner with text labels around it.",
    "page_type": null,
    "pdf_page_no": 129,
    "book_page_no": 125,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/129.jpeg"
  },
  {
    "text": "\\nMemory Lane\\n\\nNew words to know\\npeer\\nto look closely\\nor with\\ndifficulty\\nfierce\\nhaving or\\nshowing an\\nintense\\naggressiveness\\ndisrupt\\nto interrupt by\\ncausing a\\ndisturbance or\\nproblem\\nvast\\nof very great\\nextent or size\\n\\nActivity: Vocabulary Puzzle\\n\\nHere's a fun puzzle for you!\\n\\nSolve the crossword puzzle using the new words you've learned.\\nClues:\\n\\nAcross:\\n1. The storm was not just strong; it was ________.\\n2. The storm did this to the phone and internet services.\\n\\nDown:\\n3. The sky Pinky saw through her window was ________ and full of dark\\nclouds.\\n2. When you look very carefully through the window during the storm.\\n\\nObject: Illustration of a crossword puzzle with clues and partially filled answers.",
    "page_type": null,
    "pdf_page_no": 130,
    "book_page_no": 126,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/130.jpeg"
  },
  {
    "text": "\\nJourney through the text\n\nRace Against Time\n\nPinky peered out her window, everything was as dark as the night. She had just heard the news - a fierce storm was coming, heading straight towards Rani's house on the other side of the city. She knew she had to warn her friend immediately. But how could she? The power had been gone for days because of the rain. That means there was no internet. She couldn't call her on WhatsApp or message her.\n\nWhat problem was Pinky facing?\n\nPinky looked at her computer in frustration. This was of no use as well. She grabbed her landline phone, but the storm had disrupted the phone lines too. The usual buzzing town seemed cut off from the world, and time was running out.\n\nAs the wind howled outside, Pinky's eyes fell on her pet parrot, Coco. An idea sparked in her mind. \"A letter! Coco can deliver it!\" she exclaimed. She had heard from her Dadi how in the old days, people used their pigeons to deliver little notes to each other. Pinky quickly scribbled a tiny letter, her hands trembling:\n\nDear Rani,\nA storm is coming your way. Please find a safe space. Take care. See you once the storm clears!\n\nYours\nPinky\n\nObject: Illustration of a hand writing a letter with a parrot looking on, dialogue bubbles showing the parrot with a confused expression, and a light bulb with a question mark above the parrot.",
    "page_type": null,
    "pdf_page_no": 131,
    "book_page_no": 127,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/131.jpeg"
  },
  {
    "text": "She folded the note, sealed it carefully, and attached it to Coco's leg.\\n\\n\"Go to Rani, quickly!\" she urged. She showed Coco Rani's picture. He understood immediately.\\n\\nCoco took off into the stormy sky, a tiny messenger against the vast, grey clouds. Pinky watched anxiously, hoping her message would reach Rani in time. The safety of her friend now depended on a small bird braving the storm.\\n\\nWrite down any other way of communicating that Pinky might have missed:\\n\\nDiving deeper\\n\\nActivity 1: Refer to the Text\\n\\nSometimes you need to directly refer to the text to find answers!\\n\\nAnswer the following questions about Pinky's story, providing specific parts of the text to support your answers.\\n\\n1. How did Pinky first learn about the incoming storm? Quote the part of the story that describes this.\\n2. How did Pinky decide to write a letter to Dadi? Write down that part to support your answer.\\nObject: Illustration of cloudy sky with wind and a flying bird carrying a note.",
    "page_type": null,
    "pdf_page_no": 132,
    "book_page_no": 128,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/132.jpeg"
  },
  {
    "text": "Activity 2: Character and Setting Inspection\n\nNow see if you have read carefully!\n\n1. Write down two character traits of Pinky from the story.\n2. Write down two details about the setting from the story.\n3. Now based on your findings, predict what will happen next to Pinky and the setting in the story.\n\nObject: Illustrations of a boy looking at a book and a girl with an umbrella in different weather conditions.\n\nActivity 3: Simile and Metaphor\n\nLet's make our writing more interesting!\n\nSimiles are comparisons using the words 'like' or 'as' to show similarities between two different things. For example, \"busy as a bee\" compares someone's busyness to a bee's.",
    "page_type": null,
    "pdf_page_no": 133,
    "book_page_no": 129,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/133.jpeg"
  },
  {
    "text": "Metaphors directly state that one thing is another, helping to paint a picture in the reader's mind. For example, \"time is a thief\" suggests that time steals moments away like a thief.\nObject: Illustration of two children, one thinking of a clock and another thinking of a cloud and the sun.\n\nNow find and write down one metaphor and one simile from the story.\n\n- Explain what the simile means: ______________________________________________________________________\n\n- Explain what the metaphor means: ______________________________________________________________________\n\nShare and Sparkle\n\nActivity 1: Guess the Action\n\nLet's see how well your friends can act and how well you can guess!\n\n- Get into pairs.\n- One student describes a communication method without naming it (E.g., writing a letter, using a phone, sending an email), and the other guesses what it is.\n- Partners switch roles after each round.",
    "page_type": null,
    "pdf_page_no": 134,
    "book_page_no": 130,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/134.jpeg"
  },
  {
    "text": "Activity 2: Say it Right\n\nThe meanings of sentences can change according to how you say them!\n\nHere are some sentences for you to act out in groups. Discuss how the different ways of saying each sentence changes its meaning:\n\n\"I can't believe you did that!\"\n- First, say it with surprise, then with disappointment.\n\"Are you going to finish that project?\"\n- Say it once with curiosity, then with urgency.\n\"That's the biggest dog I've ever seen!\"\n- First, express it with excitement, then with fear.\n\"We should definitely meet up this weekend.\"\n- Say it with enthusiasm, then with hesitation.\n\"Please, be careful with that!\"\n- Express it first with concern, then with annoyance.\nObject: Illustration of a group of children sitting around a carpet, some blocks, a plant, and a book visible on the floor. The children appear to be engaging in a discussion or activity. Speech bubbles are present.",
    "page_type": null,
    "pdf_page_no": 135,
    "book_page_no": 131,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/135.jpeg"
  },
  {
    "text": "\\nGrammar Playground\\nActivity 1: Show Me Where It Is\\nLet's recap our knowledge of prepositions!\\n\\nPosition:\nWords like 'under,' 'above,' 'between' show where something is located.\\n\\nTime:\nWords like 'before,' 'after,' 'during' indicate when something happens.\\n\\nMovement:\nWords like 'towards,' 'away from,' 'into' describe the direction of movement.\\n\\nDirection:\nWords like 'to,' 'from,' 'up,' 'down' show the direction something is moving or facing.\\n\\nFill in the blanks using the correct prepositions.\\n\\nThe parrot flew towards the room, landing on the shelf, just near clock. Example\\n1. The child ran ________ the mother.\\n2. The car was speeding ________ from the storm.\\n3. The girl took out a cup ________ the cupboard.\\nObject: Illustration of a car with rain and wind indicating speed, located underneath the text 'The car was speeding ________ from the storm.'\\nObject: Illustration of a girl reaching into a cupboard, located underneath the text 'The girl took out a cup ________ the cupboard.'",
    "page_type": null,
    "pdf_page_no": 136,
    "book_page_no": 132,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/136.jpeg"
  },
  {
    "text": "\\nActivity 2: Connector Chain\n\nConnecting sentences can be fun once you know what connector to use!\n\nAddition (and, as well as, also, moreover, furthermore): These connectors add more information or ideas.\nReason (because, as, since, for): This connector explains why something happens.\nSequence (first, second, finally, when, after): These connectors show the order in which things happen.\n\nCombine these sentences using the correct connector word.\n\nThe wind blew fiercely. The children still played outside.\nThe wind blew fiercely but the children still played outside.\\nExample\n\n1. Pinky wanted to warn Rani. She could not use the internet.\n__________________________________________________________________________\n\n2. We need phones. We need laptops in the new office.\n__________________________________________________________________________\n\n3. In order to send an email you need to log into your computer.\nYou need to open your account.\n__________________________________________________________________________\n\n4. We need to pick up your sister. We will pick you after that.\n__________________________________________________________________________\nObject: Icon of a speech bubble labeled \"Example\" below the sample sentence.",
    "page_type": null,
    "pdf_page_no": 137,
    "book_page_no": 133,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/137.jpeg"
  },
  {
    "text": "Imagination Canvas\n\nLet's learn to write about past events.\n\nThe past continuous tense describes actions that were happening at a particular moment in the past.\n\nIt is formed with the past tense of the verb 'to be' (was\\/were) followed by the base verb with an '-ing' ending.\n\nActivity: Echoes of the Past\n\nWrite a paragraph about how your grandparents used to communicate with each other. Did they use telephones to talk to someone living in the same country? Did they have a TV or a radio to know what was going on in the rest of the world?\n\nUse past continuous tense to write your paragraph.\n\nObject: Illustration of a smiling globe with a telephone receiver.",
    "page_type": null,
    "pdf_page_no": 138,
    "book_page_no": 134,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/138.jpeg"
  },
  {
    "text": "\\nConnect and Create\\nRemember the short letter I wrote for my friend Rani? Now it's your turn to write one!\\nAn informal letter is a personal way to communicate with family and friends. It can be as long or as short as you want. You can add personal touches to it to make it fun, interesting and heartwarming to read.\\nProject: Message in a Bottle\\nImagine you are stranded on an island. You are alone and miss your friends and family. Who would you write a letter to? Write it down below in this bottle and let the wave carry your bottle to the recipient.\\nExample of an Informal Letter:\\nUnknown Island\\n20 November 2023\\nDear Mama,\\nI hope you are well. I am stuck on this island and I don't know for how long I will be stuck here. But I really miss you, Mama. You have always been there for me. You have clothed me, bathed me, fed me and raised me. I am so thankful for you. You have the prettiest smile and the biggest laugh.\\nPlease look after yourself. I am trying to find a way to get back home. Say hello to everyone else for me.\\nLove,\\nPinky",
    "page_type": null,
    "pdf_page_no": 139,
    "book_page_no": 135,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/139.jpeg"
  },
  {
    "text": "Activity: Skill Review\n\nNow let's take a moment to think about what we learned!\n\n\\u2022 Write down one skill you learned in this chapter and how you will use it in daily life.\n\\u2022 Write down one thing that surprised you about the different ways we communicate.\n\\u2022 Write down one thing you still don't feel that confident about.\nObject: A decorative line drawing at the bottom featuring stylized water splashes and grass.",
    "page_type": null,
    "pdf_page_no": 140,
    "book_page_no": 136,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/140.jpeg"
  },
  {
    "text": "\\nFinding Home\\n\\nExplorer's Pathway\\nRecall and discuss important features of a talk, possibly contributing new ideas within familiar and unfamiliar group settings.\\nParticipate in group discussions, presentations and debates.\\nTalk confidently in extended turns and listen purposefully in a range of contexts.\\nRetell or paraphrase events from the text in response to questions.\\nInvestigate how settings and characters are built up from details and identify keywords and phrases.\\nIdentify how expressive and descriptive language creates different types of reading and writing.\\nTake dictation of paragraph\\/text of grade level.\\nKeep a record of words (e.g., word wall, word bank, word journal).\\nRecognise direct speech sentences in a narration.\\nUnderstand and use adverbs of manner, time, place and frequency.\\nUse of future tense will\\/shall\\/be going to + infinitive.\\nParaphrase the text in your own words.\\nDraft and write a formal letter\\/ email, application, complaint.\\nObject: Illustration of a treasure chest filled with gold coins at the bottom of a curved pathway.",
    "page_type": null,
    "pdf_page_no": 141,
    "book_page_no": 137,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/141.jpeg"
  },
  {
    "text": "Memory Lane\n\nNew words to know\n\nObject: Illustration of an eye next to the word 'gaze.'\ngaze:\nto look steadily\nand intently,\nespecially in\nadmiration,\nsurprise, or\nthought\n\nObject: Illustration of a face with a sneer expression next to the word 'sneer.'\nsneer:\nto smile or\nspeak in a\nmocking manner\n\nObject: Illustration of a face with an open mouth next to the word 'gasp.'\ngasp:\nto take a quick,\nsharp breath\nthrough the\nmouth in shock\n\nObject: Illustration of a running person next to the word 'scurry.'\nscurry:\nto move\nhurriedly with\nshort, quick\nsteps\n\nActivity: Verb Impression Challenge\n\nObject: Icon of a round character with a speech bubble above saying 'Hey! Did you notice how all of these new words are verbs? Let's act them out!'\nObject: Illustrations of children acting out the verbs 'gaze,' 'gasp,' 'sneer,' and 'scurry.'",
    "page_type": null,
    "pdf_page_no": 142,
    "book_page_no": 138,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/142.jpeg"
  },
  {
    "text": "Journey through the text\n\nPinky and the Fairies\n\nPinky gazed around her new, windowless room in a new city, miles away from the familiar streets of Taleemabad. \"Everything's so different here,\" she sighed, missing the laughter and games with her friends back home.\n\nAt school, her day went from bad to worse. \"Why is your hair so... pink?\" sneered a classmate, setting off a wave of giggles. Pinky's heart sank. Her pink hair, once a badge of pride, now felt like a burden.\nObject: Illustration of Pinky in her room looking sad, with thought bubbles saying \"haha\" and \"funny hair.\"\n\nAt home, her parents were lost in their busy schedules, and Jojo, her brother, was sulking over the deal for dinner again. That night, as Pinky lay in bed, tears staining her pillow, she whispered, \"I wish I could go back.\" Just then, she noticed a gentle rustling and a faint glow. Before her eyes, tiny figures with shiny wings and wide sparkling eyes appeared, tidying her room and leaving small treats. \"Who are you?\" Pinky gasped in wonder.\n\nThey didn't speak. They just giggled and braided Pinky's hair. Days passed, and Pinky's gloom slowly lifted, thanks to the fairies' nightly visits. They bounced from place to place, making Pinky laugh.\n\nEvery day she would come home to a special treat on her bed, left by the fairies. No one else could see them scurrying around the house but Pinky.\nObject: Illustration of fairies floating near Pinky's bed, appearing joyful and whimsical.",
    "page_type": null,
    "pdf_page_no": 143,
    "book_page_no": 139,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/143.jpeg"
  },
  {
    "text": "Chapter 12\nFinding Home\n\nWho are the characters in this story?\n\"You've made this place feel like a home,\" Pinky smiled one evening, watching them dance around her room.\n\nEventually, Pinky found her footing in the new city. She even made new friends and loved going to school.\nObject: Illustration of a young girl (Pinky) surprised by fairies flying around her (each fairy is depicted with musical notes), pulling items out of a bag indicating a magical or imaginative context.\n\nHow does the setting of the story change when the fairies come into the story?\n\nOne night, Pinky noticed the fairies packing tiny bags. \"Are you leaving?\" she asked, a hint of sadness in her voice.\n\nThe fairies pointed towards the door and smiled. It was clear that they had another home to go to. Another child who felt out of place to cheer up.\n\nAs the fairies vanished into the night, Pinky felt a newfound strength. She whispered, \"Thank you, my little friends. I'm ready for this new adventure.\"\n\nWrite down three keywords from this story:",
    "page_type": null,
    "pdf_page_no": 144,
    "book_page_no": 140,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/144.jpeg"
  },
  {
    "text": "Diving Deeper\n\nActivity 1: Retelling Pinky's Journey\n\nObject: Icon of a speech bubble with the text \"Wow what a fun story! Let's see if you can tell someone else about it using your own words.\"\nRetell \"Pinky and the Fairies\" focusing on key events like her struggles at first, the discovery of the fairies, and how they helped her.\n\nActivity 2: Painting with words!\n\nObject: Icon of a paint palette with the text \"Writing a story is no joke. You have to paint a picture with just your words!\"\nUsing expressive and descriptive language helps writers enhance the narrative.\n\n- Find an example where Pinky's new home is described. How does this description make you feel about the place?",
    "page_type": null,
    "pdf_page_no": 145,
    "book_page_no": 141,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/145.jpeg"
  },
  {
    "text": "When Pinky first sees the fairies, which words or phrases describe their appearance or actions?\n\nThe story uses the word 'gasp' when Pinky discovers the fairies.\n\nWhat effect does this word have on the reader?\n\nLook for a sentence where Pinky feels happy or relieved. Which words express her emotions?\n\nActivity 3: Comprehension Quiz\nObject: Illustration of a book with a smiley face on the cover under the section title 'Comprehension Quiz.'\nLet's dive into the story once more!\nAnswer these questions based on Pinky's story.\nWhat made Pinky feel out of place in her new school?",
    "page_type": null,
    "pdf_page_no": 146,
    "book_page_no": 142,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/146.jpeg"
  },
  {
    "text": "What was Pinky's brother's reaction to the dinner?\n\n\n\nHow did Pinky's feelings about her new home change by the end of the story?\n\n\n\n- Share and Sparkle\n\nActivity 1: Being New and Feeling Blue\n\nLet's talk about a time when we felt sad and alone.\nIn small groups, discuss times when you felt out of place or new, just like Pinky.\nShare your experiences and strategies that helped you adapt.\n\nActivity 2: Best Plan\n\nTime for another healthy debate session!\n\"Is it more important to blend in or stand out when moving to a new place?\"\nOne group argues the benefits of blending in and adapting to the new environment quickly\nobject: Illustration of a sad emoticon with caption \"Share and Sparkle\" under \"Activity 1: Being New and Feeling Blue.\"\nobject: Illustration of a thinking emoticon with caption \"Best Plan\" under \"Activity 2: Best Plan.\"",
    "page_type": null,
    "pdf_page_no": 147,
    "book_page_no": 143,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/147.jpeg"
  },
  {
    "text": "\\nActivity 2: Best Plan\\nThe other group supports standing out and maintaining one's unique identity.\\nGuidelines for the Debate:\\n\\u00b7 Prepare points that explain why blending in or standing out is beneficial in a new setting.\\n\\u00b7 Use examples from personal experiences, stories, or even Pinky's story from the textbook.\\n\\u00b7 Practice using persuasive language and clear expression.\\nObject: Illustration of two children labeled \"Blend in\" and \"Stand out.\"\\n\\nActivity 3: First Day in a New School\\nNow, it's time for the magic of theatre again!\\nIn pairs, role-play a scenario where one student is new to a school, and the other is a welcoming classmate.\\nDiscuss how to make the new student feel included.\\nObject: Illustration of two children, one at a desk with school supplies including an apple, books, and a backpack, and the other presenting in front of a chalkboard with the numbers 1, 2, 3 on it.",
    "page_type": null,
    "pdf_page_no": 148,
    "book_page_no": 144,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/148.jpeg"
  },
  {
    "text": "Grammar Playground\n\nActivity 1: Adverb Match Up\n\nLet's refresh our minds and recall what adverbs are!\n\nAdverbs add more detail to verbs, adjectives, or other adverbs.\nThey answer questions like how (manner), when (time), where (place), and how often (frequency).\nExample: \\\"She quickly (how) finished her homework yesterday (when) at the library (where) and often (how often) helps her friends.\\\"\n\nComplete the sentences using these adverbs. Then, use each adverb to write a new sentence.\n\nAdverbs: quickly, tomorrow, outside, rarely, loudly, beautifully\n\n1. She will sing loudly at the concert.\nSentence: My mother yelled loudly to wake me up.\n\n2. They play football after school .\nSentence: ___________________________________________\n\n3. He will announce the winners.\nSentence: ___________________________________________\n\n4. She does her homework.\nSentence: ___________________________________________\n\n5. We will have a picnic .\nSentence: ___________________________________________",
    "page_type": null,
    "pdf_page_no": 149,
    "book_page_no": 145,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/149.jpeg"
  },
  {
    "text": "6. I go to the movies.\nSentence: __________\n\nActivity 2: Mastering the Future Tense\n\nObject: Illustration of a crystal ball with a caption \"Let's predict our futures again!\"\nThe future tense talks about actions that will happen. It's made with 'will,' 'shall,' or 'be going to' + the base form of a verb.\n\nExample, \"She will go to school tomorrow.\" / \"They are going to play football.\"\n\nNow fill in the blanks with the correct future tense form.\n1. We shall start the project next week.\n2. She _______ visit her grandparents in the summer.\n3. They _______ celebrate their birthday together.\n4. I think it _______ rain tomorrow.\n5. He _______ finish his homework before dinner.\n6. You _______ see a big improvement soon.\n\nActivity 3: Direct Speech Marvels\n\nObject: Illustration of a quotation mark with a caption \"Time to learn about direct speech!\"\nDirect speech shows exactly what a character says, using quotation marks.\n\nExample, Pinky said, \"I feel strange in this new city.\"",
    "page_type": null,
    "pdf_page_no": 150,
    "book_page_no": 146,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/150.jpeg"
  },
  {
    "text": "1. Find sentences with direct speech in Pinky's story and underline them.\\\\n2. Imagine the fairies in the story could speak. What would they say?\\\\n3. Write down two of your own direct speech sentences:\\\\n\\n\\nImagination Canvas\\\\n\\nActivity: Storytelling in Reverse\\\\n\\nI'm sure you liked my story. But what happens if you write it in reverse?\\\\nRetell \\",
    "page_type": null,
    "pdf_page_no": 151,
    "book_page_no": 147,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/151.jpeg"
  },
  {
    "text": "\\nConnect and Create\\n\\nProject: Writing a Formal Letter\\n\\nTime to get your pens and paper out!\\n\\nImagine you are moving to a new school, like Pinky. Write a formal letter to the class teacher of your new school introducing yourself, explaining how you feel and what you need to help you in your new environment.\\n\\nTo make your writing super special with cursive handwriting, just follow these easy steps:\\n\\nLoop and Link: Practise making loops on your letters. Then, try connecting them, like linking hands with your friends. It's like drawing waves or loops that touch each other!\\n\\nTake It Slow: No need to hurry. Go slow and make your loops and links nice and smooth. Imagine your pencil is a slow-moving train, not skipping any stations!\\nObject: Illustration of cursive alphabet from 'a' to 'z'.\\nNow let's write our letter!\\n\\nSteps\\n\\nIntroduction:\\nStart with a polite greeting and introduce yourself.",
    "page_type": null,
    "pdf_page_no": 152,
    "book_page_no": 148,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/152.jpeg"
  },
  {
    "text": "Body\n- Explain that you are new to the school and mention something positive you've heard about it.\n- Express any concerns you might have like making friends or finding your way about the school.\n\nConclusion\nThank the teacher for listening.\n\nClosing\nEnd with a formal closing, like \"Sincerely,\" followed by your name.\n\nGuidelines\n- Use formal language and a respectful tone.\n- Ensure proper use of capitalization, punctuation, and spelling.\n- Keep the letter clear and to the point.\n\nActivity: Reflecting and Understanding\n\n- Write down one new word you learned in this chapter and use it in a sentence.\n\n- Create a sentence using an adverb of manner (e.g., quickly, quietly) to describe an action.\n\n- If you were to write a letter to help someone feel more comfortable in a new place, what would you say in one sentence?\n\nObject: Illustration of kids and a teacher at school with various school items like books and a backpack.",
    "page_type": null,
    "pdf_page_no": 153,
    "book_page_no": 149,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/153.jpeg"
  },
  {
    "text": "Chapter 12\nFinding Home",
    "page_type": null,
    "pdf_page_no": 154,
    "book_page_no": 150,
    "pdf_page_image_url": "https://lmsreborn-bookmapping-images.s3.ap-south-1.amazonaws.com/book_images/English_G4_Taleemabad_07d0fca4-236f-4d97-89ab-378b00aaf815/154.jpeg"
  }
]